wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/io/rtl876x_tim_def.h
/**
**********************************************************************************************************
*               Copyright(c) 2024, Realtek Semiconductor Corporation. All rights reserved.
**********************************************************************************************************
* @file     rtl876x_tim_def.h
* @brief    TIM related definitions
* @details
* @author
* @date
* @version  v1.0.0
*********************************************************************************************************
*/
#ifndef RTL876X_TIM_DEF_H
#define RTL876X_TIM_DEF_H

#ifdef  __cplusplus
extern "C" {
#endif /* __cplusplus */

#include "rtl876x.h"

/*============================================================================*
 *                          TIM Defines
 *============================================================================*/
/** \defgroup TIM      TIM
  * \brief
  * \{
  */

/** \defgroup TIM_Exported_Constants TIM Exported Constants
  * \brief
  * \{
  */

/**
 * \defgroup TIM_Defines TIM Defines
 * \{
 * \ingroup  TIM_Exported_Constants
 */
/**********************************************************************************************************************
 **********************************************************************************************************************
 |             Function              | case1  case7  case6  case2  case3  case4  case5 |         TIM Defines          |
 |-----------------------------------|-------------------------------------------------|------------------------------|
 |  Timer Only                       |   Y      Y      Y      Y      Y      Y      Y   |  NO                          |
 |-----------------------------------|-------------------------------------------------|------------------------------|
 |  PWM Only                         |          Y      Y      Y      Y      Y      Y   |  TIM_SUPPORT_PWM_FUNCTION    |
 |-----------------------------------|-------------------------------------------------|------------------------------|
 |  PWM with shift_mode + dead_zone  |                 Y      Y      Y      Y      Y   |  TIM_SUPPORT_PWM_PHASE_SHIFT |
 |                                   |                                                 |  TIM_SUPPORT_PWM_DEADZONE    |
 |-----------------------------------|-------------------------------------------------|------------------------------|
 |  PWM with CCR FIFO                |                        Y      Y      Y      Y   |  TIM_SUPPORT_CCR_FIFO        |
 |-----------------------------------|-------------------------------------------------|------------------------------|
 |  PWM with CCR FIFO + DMA          |                               Y      Y      Y   |  TIM_SUPPORT_CCR_FIFO        |
 |                                   |                                                 |  TIM_SUPPORT_DMA             |
 |-----------------------------------|-------------------------------------------------|------------------------------|
 |  LATCH_COUNT_0                    |                                      Y      Y   |  TIM_SUPPORT_LATCH_CNT_0     |
 |-----------------------------------|-------------------------------------------------|------------------------------|
 |  LATCH_COUNT_1 + LATCH_COUNT_2    |                                             Y   |  TIM_SUPPORT_LATCH_CNT_1     |
 |                                   |                                                 |  TIM_SUPPORT_LATCH_CNT_2     |
 |-----------------------------------|-------------------------------------------------|------------------------------|
 ***********************************************************************************************************************/
#define TIM_SUPPORT_PWM_FUNCTION                    (1) /* Case7 */
#define TIM_SUPPORT_PWM_PHASE_SHIFT                 (1) /* Case6 */
#define TIM_SUPPORT_PWM_DEADZONE                    (1) /* Case6 */
#define TIM_SUPPORT_CCR_FIFO                        (1) /* Case2 Case3*/
#define TIM_SUPPORT_DMA_FUNCTION                    (1) /* Case3 */
#define TIM_SUPPORT_LATCH_CNT_0                     (1) /* Case4 */
#define TIM_SUPPORT_LATCH_CNT_1                     (1) /* Case5 */
#define TIM_SUPPORT_LATCH_CNT_2                     (1) /* Case5 */

#define TIM_SUPPORT_RAP_FUNCTION                    (0)
#define TIM_SUPPORT_AUTO_CLOCK                      (0)

/** End of TIM_Defines
  * \}
  */

/** End of TIM_Exported_Constants
  * \}
  */

/** End of TIM
  * \}
  */

/*============================================================================*
 *                         TIM Registers Memory Map
 *============================================================================*/
typedef struct
{
    __I  uint32_t TIMER_CUR_CNT;                /*!< 0x00 */
    __IO uint32_t TIMER_MODE_CFG;               /*!< 0x04 */
    __IO uint32_t TIMER_MAX_CNT;                /*!< 0x08 */
    __IO uint32_t TIMER_CCR;                    /*!< 0x0C */
    __IO uint32_t TIMER_CCR_FIFO;               /*!< 0x10 */
    __IO uint32_t TIMER_PWM_CFG;                /*!< 0x14 */
    __IO uint32_t TIMER_PWM_SHIFT_CNT;          /*!< 0x18 */
    __IO uint32_t TIMER_LAT_CNT_0_CFG;          /*!< 0x1C */
    __I  uint32_t TIMER_LAT_CNT_0;              /*!< 0x20 */
    __I  uint32_t TIMER_LAT_CNT_0_FIFO_DEPTH;   /*!< 0x24 */
    __IO uint32_t TIMER_LAT_CNT_1_CFG;          /*!< 0x28 */
    __I  uint32_t TIMER_LAT_CNT_1;              /*!< 0x2C */
    __I  uint32_t TIMER_LAT_CNT_1_FIFO_DEPTH;   /*!< 0x30 */
    __IO uint32_t TIMER_LAT_CNT_2_CFG;          /*!< 0x34 */
    __I  uint32_t TIMER_LAT_CNT_2;              /*!< 0x38 */
    __I  uint32_t TIMER_LAT_CNT_2_FIFO_DEPTH;   /*!< 0x3C */
    __IO uint32_t TIMER_DMA_CFG;                /*!< 0x40 */
    __I  uint32_t TIMER_DMY_0;                  /*!< 0x44 */
    __I  uint32_t TIMER_DMY_1;                  /*!< 0x48 */
    __I  uint32_t TIMER_DMY_2;                  /*!< 0x4C */
} TIM_TypeDef;

typedef struct
{
    __IO uint32_t TIMER_EN_CTRL;                                   /*!< 0xA00 */
    __IO uint32_t TIMER_ONESHOT_GO_CTRL;                           /*!< 0xA04 */
    __I  uint32_t TIMER_PWM_STATE;                                 /*!< 0xA08 */
    __IO uint32_t TIMER_INTR_EN_CTRL;                              /*!< 0xA0C */
    __IO uint32_t TIMER_INTR_STS;                                  /*!< 0xA10 */
    __I  uint32_t TIMER_INTR;                                      /*!< 0xA14 */
    __I  uint32_t TIMER_CCR_FIFO_EMPTY_STS;                        /*!< 0xA18 */
    __I  uint32_t TIMER_CCR_FIFO_FULL_STS;                         /*!< 0xA1C */
    __IO uint32_t TIMER_LAT_CNT_0_FIFO_FULL_INTR_EN_CTRL;          /*!< 0xA20 */
    __IO uint32_t TIMER_LAT_CNT_0_FIFO_MET_THRESHOLD_INTR_EN_CTRL; /*!< 0xA24 */
    __I  uint32_t TIMER_LAT_CNT_0_FIFO_EMPTY_STS;                  /*!< 0xA28 */
    __IO uint32_t TIMER_LAT_CNT_0_FIFO_FULL_INTR;                  /*!< 0xA2C */
    __IO uint32_t TIMER_LAT_CNT_0_FIFO_MET_THRESHOLD_INTR;         /*!< 0xA30 */
    __I  uint32_t TIMER_LAT_CNT_1_FIFO_FULL_INTR_EN_CTRL;          /*!< 0xA34 */
    __I  uint32_t TIMER_LAT_CNT_1_FIFO_MET_THRESHOLD_INTR_EN_CTRL; /*!< 0xA38 */
    __I  uint32_t TIMER_LAT_CNT_1_FIFO_EMPTY_STS;                  /*!< 0xA3C */
    __I  uint32_t TIMER_LAT_CNT_1_FIFO_FULL_INTR;                  /*!< 0xA40 */
    __I  uint32_t TIMER_LAT_CNT_1_FIFO_MET_THRESHOLD_INTR;         /*!< 0xA44 */
    __I  uint32_t TIMER_LAT_CNT_2_FIFO_FULL_INTR_EN_CTRL;          /*!< 0xA48 */
    __I  uint32_t TIMER_LAT_CNT_2_FIFO_MET_THRESHOLD_INTR_EN_CTRL; /*!< 0xA4C */
    __I  uint32_t TIMER_LAT_CNT_2_FIFO_EMPTY_STS;                  /*!< 0xA50 */
    __I  uint32_t TIMER_LAT_CNT_2_FIFO_FULL_INTR;                  /*!< 0xA54 */
    __I  uint32_t TIMER_LAT_CNT_2_FIFO_MET_THRESHOLD_INTR;         /*!< 0xA58 */
    __IO uint32_t TIMER_PAUSE_CTRL;                                /*!< 0xA5C */
    __IO uint32_t TIMER_PAUSE_INTR_EN_CTRL;                        /*!< 0xA60 */
    __IO uint32_t TIMER_PAUSE_INTR_STS;                            /*!< 0xA64 */
    __I  uint32_t TIMER_PAUSE_INTR;                                /*!< 0xA68 */
    __I  uint32_t TIMER_DMY;                                       /*!< 0xA6C */
    __IO uint32_t TIMER_Q_CH_FW_CTRL0;                             /*!< 0xA70 */
    __IO uint32_t TIMER_Q_CH_FW_CTRL1;                             /*!< 0xA74 */
    __I  uint32_t TIMER_Q_CH_DMY_0;                                /*!< 0xA78 */
    __I  uint32_t TIMER_Q_CH_DMY_1;                                /*!< 0xA7C */
    __IO uint32_t TIMER_RAP_CTRL0;                                 /*!< 0xA80 */
    __IO uint32_t TIMER_RAP_CTRL1;                                 /*!< 0xA84 */
    __IO uint32_t TIMER_RAP_FW_TSAK_START;                         /*!< 0xA88 */
    __IO uint32_t TIMER_RAP_FW_TASK_PAUSE;                         /*!< 0xA8C */
    __IO uint32_t TIMER_RAP_FW_TASK_DISABLE;                       /*!< 0xA90 */
    __I  uint32_t TIMER_RAP_STS_ACTIVE;                            /*!< 0xA94 */
    __IO uint32_t TIMER_RAP_SHORTCUT_SUB_TASK_PAUSE;               /*!< 0xA98 */
    __IO uint32_t TIMER_RAP_SHORTCUT_SUB_TASK_DISABLE;             /*!< 0xA9C */
    __IO uint32_t TIMER_RAP_SHORTCUT_PUB_EVENT_TIMEOUT;            /*!< 0xAA0 */
    __I  uint32_t TIMER_RAP_DMY_0;                                 /*!< 0xAA4 */
    __I  uint32_t TIMER_RAP_DMY_1;                                 /*!< 0xAA8 */
    __I  uint32_t TIMER_RAP_DMY_2;                                 /*!< 0xAAC */
    __I  uint32_t TIMER_IP_VER;                                    /*!< 0xAB0 */
} TIM_ShareTypeDef;

