wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/io/rtl876x_tim_def.h
/*============================================================================*
 *                         TIM Declaration
 *============================================================================*/
/** \defgroup TIM      TIM
  * \brief
  * \{
  */

/** \defgroup TIM_Exported_Constants TIM Exported Constants
  * \brief
  * \{
  */

/** \defgroup TIM_Declaration TIM Declaration
  * \{
  * \ingroup  TIM_Exported_Constants
  */

#define TIMER0_SHARE                 ((TIM_ShareTypeDef *) (TIMER0_BASE + 0xA00))
#define TIMER1_SHARE                 ((TIM_ShareTypeDef *) (TIMER1_BASE + 0xA00))

/*============================================================================*
 *                         TIM0 Declaration
 *============================================================================*/
#define TIMER0_CH0_REG_BASE          (TIMER0_BASE + 0x0000)
#define TIMER0_CH1_REG_BASE          (TIMER0_BASE + 0x0050)

#define TIM0_CH0                     ((TIM_TypeDef *) TIMER0_CH0_REG_BASE)
#define TIM0_CH1                     ((TIM_TypeDef *) TIMER0_CH1_REG_BASE)

#define IS_TIM0_PERIPH(PERIPH)       (((PERIPH) == TIM0_CH0) || \
                                      ((PERIPH) == TIM0_CH1))

/*============================================================================*
 *                         TIM1 Declaration
 *============================================================================*/
#define TIMER1_CH0_REG_BASE          (TIMER1_BASE + 0x0000)
#define TIMER1_CH1_REG_BASE          (TIMER1_BASE + 0x0050)
#define TIMER1_CH2_REG_BASE          (TIMER1_BASE + 0x00A0)
#define TIMER1_CH3_REG_BASE          (TIMER1_BASE + 0x00F0)
#define TIMER1_CH4_REG_BASE          (TIMER1_BASE + 0x0140)
#define TIMER1_CH5_REG_BASE          (TIMER1_BASE + 0x0190)
#define TIMER1_CH6_REG_BASE          (TIMER1_BASE + 0x01E0)
#define TIMER1_CH7_REG_BASE          (TIMER1_BASE + 0x0230)
#define TIMER1_CH8_REG_BASE          (TIMER1_BASE + 0x0280)
#define TIMER1_CH9_REG_BASE          (TIMER1_BASE + 0x02D0)

#define TIM1_CH0                     ((TIM_TypeDef *) TIMER1_CH0_REG_BASE)
#define TIM1_CH1                     ((TIM_TypeDef *) TIMER1_CH1_REG_BASE)
#define TIM1_CH2                     ((TIM_TypeDef *) TIMER1_CH2_REG_BASE)
#define TIM1_CH3                     ((TIM_TypeDef *) TIMER1_CH3_REG_BASE)
#define TIM1_CH4                     ((TIM_TypeDef *) TIMER1_CH4_REG_BASE)
#define TIM1_CH5                     ((TIM_TypeDef *) TIMER1_CH5_REG_BASE)
#define TIM1_CH6                     ((TIM_TypeDef *) TIMER1_CH6_REG_BASE)
#define TIM1_CH7                     ((TIM_TypeDef *) TIMER1_CH7_REG_BASE)
#define TIM1_CH8                     ((TIM_TypeDef *) TIMER1_CH8_REG_BASE)
#define TIM1_CH9                     ((TIM_TypeDef *) TIMER1_CH9_REG_BASE)

#define IS_TIM1_PERIPH(PERIPH)       (((PERIPH) == TIM1_CH0) || \
                                      ((PERIPH) == TIM1_CH1) || \
                                      ((PERIPH) == TIM1_CH2) || \
                                      ((PERIPH) == TIM1_CH3) || \
                                      ((PERIPH) == TIM1_CH4) || \
                                      ((PERIPH) == TIM1_CH5) || \
                                      ((PERIPH) == TIM1_CH6) || \
                                      ((PERIPH) == TIM1_CH7) || \
                                      ((PERIPH) == TIM1_CH8) || \
                                      ((PERIPH) == TIM1_CH9))

#define IS_TIM_ALL_PERIPH(PERIPH)    (IS_TIM0_PERIPH(PERIPH) || \
                                      IS_TIM1_PERIPH(PERIPH))

/** End of TIM_Declaration
  * \}
  */

/** End of TIM_Exported_Constants
  * \}
  */

/** End of TIM
  * \}
  */

/*============================================================================*
 *                         TIM Registers and Field Descriptions
 *============================================================================*/
/* 0x00
   31:0    R      reg_timer_cur_cnt                         32'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t reg_timer_cur_cnt: 32;
    } b;
} TIMER_CUR_CNT_TypeDef;


/* 0x04
   1:0     R/W    reg_timer_mode                            2'h0
   2       R/WAC  reg_timer_ccr_fifo_clr                    1'h0
   7:3     R      RESERVED8                                 5'h0
   8       R/W    reg_timer_oneshot_mode_en                 1'h0
   31:9    R      RESERVED6                                 23'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        uint32_t reg_timer_mode: 2;
        uint32_t reg_timer_ccr_fifo_clr: 1;
        const uint32_t reserved_1: 5;
        uint32_t reg_timer_oneshot_mode_en: 1;
        const uint32_t reserved_0: 23;
    } b;
} TIMER_MODE_CFG_TypeDef;


/* 0x08
   31:0    R/W    reg_timer_max_cnt                         32'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        uint32_t reg_timer_max_cnt: 32;
    } b;
} TIMER_MAX_CNT_TypeDef;


/* 0x0C
   31:0    R/W    reg_timer_ccr                             32'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        uint32_t reg_timer_ccr: 32;
    } b;
} TIMER_CCR_TypeDef;


/* 0x10
   31:0    R/W    reg_timer_ccr_fifo                        32'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        uint32_t reg_timer_ccr_fifo: 32;
    } b;
} TIMER_CCR_FIFO_TypeDef;


/* 0x14
   0       R/W    reg_timer_pwm_en                          1'h0
   1       R/W    reg_timer_pwm_polarity                    1'h0
   2       R/W    reg_timer_pwm_open_drain_en               1'h0
   3       R/W    reg_timer_pwm_dz_en                       1'h0
   11:4    R/W    reg_timer_pwm_dz_size                     8'h0
   12      R/W    reg_timer_pwm_dz_emg_stop                 1'h0
   13      R/W    reg_timer_pwm_dz_stop_state_n             1'h0
   14      R/W    reg_timer_pwm_dz_stop_state_p             1'h0
   16:15   R/W    reg_timer_pwm_dz_ref_sel                  2'h0
   17      R/W    reg_timer_pwm_dz_ref_n_inv_en             1'h0
   18      R/W    reg_timer_pwm_dz_ref_p_inv_en             1'h0
   19      R      RESERVED19                                1'h0
   31:20   R      RESERVED18                                12'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        uint32_t reg_timer_pwm_en: 1;
        uint32_t reg_timer_pwm_polarity: 1;
        uint32_t reg_timer_pwm_open_drain_en: 1;
        uint32_t reg_timer_pwm_dz_en: 1;
        uint32_t reg_timer_pwm_dz_size: 8;
        uint32_t reg_timer_pwm_dz_emg_stop: 1;
        uint32_t reg_timer_pwm_dz_stop_state_n: 1;
        uint32_t reg_timer_pwm_dz_stop_state_p: 1;
        uint32_t reg_timer_pwm_dz_ref_sel: 2;
        uint32_t reg_timer_pwm_dz_ref_n_inv_en: 1;
        uint32_t reg_timer_pwm_dz_ref_p_inv_en: 1;
        const uint32_t reserved_1: 1;
        const uint32_t reserved_0: 12;
    } b;
} TIMER_PWM_CFG_TypeDef;


/* 0x18
   31:0    R/W    reg_timer_pwm_phase_shift_cnt             32'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        uint32_t reg_timer_pwm_phase_shift_cnt: 32;
    } b;
} TIMER_PWM_SHIFT_CNT_TypeDef;


/* 0x1C
   0       R/W    reg_timer_latch_cnt_0_en                  1'h0
   2:1     R/W    reg_timer_latch_cnt_0_trig_mode           2'h0
   3       R/WAC  reg_timer_latch_cnt_0_fifo_clr            1'h0
   7:4     R      RESERVED36                                4'h0
   15:8    R/W    reg_timer_latch_cnt_0_fifo_th             8'h1
   31:16   R      RESERVED34                                16'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        uint32_t reg_timer_latch_cnt_0_en: 1;
        uint32_t reg_timer_latch_cnt_0_trig_mode: 2;
        uint32_t reg_timer_latch_cnt_0_fifo_clr: 1;
        const uint32_t reserved_1: 4;
        uint32_t reg_timer_latch_cnt_0_fifo_th: 8;
        const uint32_t reserved_0: 16;
    } b;
} TIMER_LAT_CNT_0_CFG_TypeDef;


/* 0x20
   31:0    R      reg_timer_latch_cnt_0                     32'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t reg_timer_latch_cnt_0: 32;
    } b;
} TIMER_LAT_CNT_0_TypeDef;


/* 0x24
   7:0     R      reg_timer_latch_cnt_0_fifo_depth          8'h0
   31:8    R      RESERVED43                                  24'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t reg_timer_latch_cnt_0_fifo_depth: 8;
        const uint32_t reserved_0: 24;
    } b;
} TIMER_LAT_CNT_0_FIFO_DEPTH_TypeDef;


/* 0x28
   0       R/W    reg_timer_latch_cnt_1_en                  1'h0
   2:1     R/W    reg_timer_latch_cnt_1_trig_mode           2'h0
   3       R      RESERVED49                                1'h0
   7:4     R      RESERVED48                                4'h0
   15:8    R      RESERVED47                                8'h1
   31:16   R      RESERVED46                                16'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        uint32_t reg_timer_latch_cnt_1_en: 1;
        uint32_t reg_timer_latch_cnt_1_trig_mode: 2;
        const uint32_t reserved_3: 1;
        const uint32_t reserved_2: 4;
        const uint32_t reserved_1: 8;
        const uint32_t reserved_0: 16;
    } b;
} TIMER_LAT_CNT_1_CFG_TypeDef;


/* 0x2C
   31:0    R      reg_timer_latch_cnt_1                     32'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t reg_timer_latch_cnt_1: 32;
    } b;
} TIMER_LAT_CNT_1_TypeDef;


/* 0x30
   7:0     R      RESERVED56                                8'h0
   31:8    R      RESERVED55                                24'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t reserved_1: 8;
        const uint32_t reserved_0: 24;
    } b;
} TIMER_LAT_CNT_1_FIFO_DEPTH_TypeDef;


/* 0x34
   0       R/W    reg_timer_latch_cnt_2_en                  1'h0
   2:1     R/W    reg_timer_latch_cnt_2_trig_mode           2'h0
   3       R      RESERVED61                                1'h0
   7:4     R      RESERVED60                                4'h0
   15:8    R      RESERVED59                                8'h1
   31:16   R      RESERVED58                                16'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        uint32_t reg_timer_latch_cnt_2_en: 1;
        uint32_t reg_timer_latch_cnt_2_trig_mode: 2;
        const uint32_t reserved_3: 1;
        const uint32_t reserved_2: 4;
        const uint32_t reserved_1: 8;
        const uint32_t reserved_0: 16;
    } b;
} TIMER_LAT_CNT_2_CFG_TypeDef;


