wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/io/rtl876x_tim_def.h
/* 0x38
   31:0    R      reg_timer_latch_cnt_2                     32'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t reg_timer_latch_cnt_2: 32;
    } b;
} TIMER_LAT_CNT_2_TypeDef;


/* 0x3C
   7:0     R      RESERVED68                                8'h0
   31:8    R      RESERVED67                                24'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t reserved_1: 8;
        const uint32_t reserved_0: 24;
    } b;
} TIMER_LAT_CNT_2_FIFO_DEPTH_TypeDef;


/* 0x40
   0       R/W    reg_timer_dma_en                          1'h0
   1       R/W    reg_timer_dma_mode                        1'h0
   3:2     R/W    reg_timer_dma_target                      2'h0
   31:4    R      RESERVED70                                28'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        uint32_t reg_timer_dma_en: 1;
        uint32_t reg_timer_dma_mode: 1;
        uint32_t reg_timer_dma_target: 2;
        const uint32_t reserved_0: 28;
    } b;
} TIMER_DMA_CFG_TypeDef;


/* 0x44
   31:0    R      RESERVED75                                32'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t reserved_0: 32;
    } b;
} TIMER_DMY_0_TypeDef;


/* 0x48
   31:0    R      RESERVED77                                32'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t reserved_0: 32;
    } b;
} TIMER_DMY_1_TypeDef;


/* 0x4C
   31:0    R      RESERVED79                                32'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t reserved_0: 32;
    } b;
} TIMER_DMY_2_TypeDef;


/* 0xA00
   0       R/W    reg_timer_0_en                              1'h0
   1       R/W    reg_timer_1_en                              1'h0
   2       R/W    reg_timer_2_en                              1'h0
   3       R/W    reg_timer_3_en                              1'h0
   4       R/W    reg_timer_4_en                              1'h0
   5       R/W    reg_timer_5_en                              1'h0
   6       R/W    reg_timer_6_en                              1'h0
   7       R/W    reg_timer_7_en                              1'h0
   8       R/W    reg_timer_8_en                              1'h0
   9       R/W    reg_timer_9_en                              1'h0
   10      R      RESERVED2489                                1'h0
   11      R      RESERVED2488                                1'h0
   12      R      RESERVED2487                                1'h0
   13      R      RESERVED2486                                1'h0
   14      R      RESERVED2485                                1'h0
   15      R      RESERVED2484                                1'h0
   16      R      RESERVED2483                                1'h0
   17      R      RESERVED2482                                1'h0
   18      R      RESERVED2481                                1'h0
   19      R      RESERVED2480                                1'h0
   20      R      RESERVED2479                                1'h0
   21      R      RESERVED2478                                1'h0
   22      R      RESERVED2477                                1'h0
   23      R      RESERVED2476                                1'h0
   24      R      RESERVED2475                                1'h0
   25      R      RESERVED2474                                1'h0
   26      R      RESERVED2473                                1'h0
   27      R      RESERVED2472                                1'h0
   28      R      RESERVED2471                                1'h0
   29      R      RESERVED2470                                1'h0
   30      R      RESERVED2469                                1'h0
   31      R      RESERVED2468                                1'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        uint32_t reg_timer_0_en: 1;
        uint32_t reg_timer_1_en: 1;
        uint32_t reg_timer_2_en: 1;
        uint32_t reg_timer_3_en: 1;
        uint32_t reg_timer_4_en: 1;
        uint32_t reg_timer_5_en: 1;
        uint32_t reg_timer_6_en: 1;
        uint32_t reg_timer_7_en: 1;
        uint32_t reg_timer_8_en: 1;
        uint32_t reg_timer_9_en: 1;
        const uint32_t reserved_21: 1;
        const uint32_t reserved_20: 1;
        const uint32_t reserved_19: 1;
        const uint32_t reserved_18: 1;
        const uint32_t reserved_17: 1;
        const uint32_t reserved_16: 1;
        const uint32_t reserved_15: 1;
        const uint32_t reserved_14: 1;
        const uint32_t reserved_13: 1;
        const uint32_t reserved_12: 1;
        const uint32_t reserved_11: 1;
        const uint32_t reserved_10: 1;
        const uint32_t reserved_9: 1;
        const uint32_t reserved_8: 1;
        const uint32_t reserved_7: 1;
        const uint32_t reserved_6: 1;
        const uint32_t reserved_5: 1;
        const uint32_t reserved_4: 1;
        const uint32_t reserved_3: 1;
        const uint32_t reserved_2: 1;
        const uint32_t reserved_1: 1;
        const uint32_t reserved_0: 1;
    } b;
} TIMER_EN_CTRL_TypeDef;


/* 0xA04
   0       R/WAC  reg_timer_0_oneshot_go                      1'h0
   1       R/WAC  reg_timer_1_oneshot_go                      1'h0
   2       R/WAC  reg_timer_2_oneshot_go                      1'h0
   3       R/WAC  reg_timer_3_oneshot_go                      1'h0
   4       R/WAC  reg_timer_4_oneshot_go                      1'h0
   5       R/WAC  reg_timer_5_oneshot_go                      1'h0
   6       R/WAC  reg_timer_6_oneshot_go                      1'h0
   7       R/WAC  reg_timer_7_oneshot_go                      1'h0
   8       R/WAC  reg_timer_8_oneshot_go                      1'h0
   9       R/WAC  reg_timer_9_oneshot_go                      1'h0
   10      R      RESERVED2522                                1'h0
   11      R      RESERVED2521                                1'h0
   12      R      RESERVED2520                                1'h0
   13      R      RESERVED2519                                1'h0
   14      R      RESERVED2518                                1'h0
   15      R      RESERVED2517                                1'h0
   16      R      RESERVED2516                                1'h0
   17      R      RESERVED2515                                1'h0
   18      R      RESERVED2514                                1'h0
   19      R      RESERVED2513                                1'h0
   20      R      RESERVED2512                                1'h0
   21      R      RESERVED2511                                1'h0
   22      R      RESERVED2510                                1'h0
   23      R      RESERVED2509                                1'h0
   24      R      RESERVED2508                                1'h0
   25      R      RESERVED2507                                1'h0
   26      R      RESERVED2506                                1'h0
   27      R      RESERVED2505                                1'h0
   28      R      RESERVED2504                                1'h0
   29      R      RESERVED2503                                1'h0
   30      R      RESERVED2502                                1'h0
   31      R      RESERVED2501                                1'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        uint32_t reg_timer_0_oneshot_go: 1;
        uint32_t reg_timer_1_oneshot_go: 1;
        uint32_t reg_timer_2_oneshot_go: 1;
        uint32_t reg_timer_3_oneshot_go: 1;
        uint32_t reg_timer_4_oneshot_go: 1;
        uint32_t reg_timer_5_oneshot_go: 1;
        uint32_t reg_timer_6_oneshot_go: 1;
        uint32_t reg_timer_7_oneshot_go: 1;
        uint32_t reg_timer_8_oneshot_go: 1;
        uint32_t reg_timer_9_oneshot_go: 1;
        const uint32_t reserved_21: 1;
        const uint32_t reserved_20: 1;
        const uint32_t reserved_19: 1;
        const uint32_t reserved_18: 1;
        const uint32_t reserved_17: 1;
        const uint32_t reserved_16: 1;
        const uint32_t reserved_15: 1;
        const uint32_t reserved_14: 1;
        const uint32_t reserved_13: 1;
        const uint32_t reserved_12: 1;
        const uint32_t reserved_11: 1;
        const uint32_t reserved_10: 1;
        const uint32_t reserved_9: 1;
        const uint32_t reserved_8: 1;
        const uint32_t reserved_7: 1;
        const uint32_t reserved_6: 1;
        const uint32_t reserved_5: 1;
        const uint32_t reserved_4: 1;
        const uint32_t reserved_3: 1;
        const uint32_t reserved_2: 1;
        const uint32_t reserved_1: 1;
        const uint32_t reserved_0: 1;
    } b;
} TIMER_ONESHOT_GO_CTRL_TypeDef;


