wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/io/rtl876x_tim_def.h
/* 0xA08
   0       R      RESERVED2565                                1'h0
   1       R      RESERVED2564                                1'h0
   2       R      RESERVED2563                                1'h0
   3       R      RESERVED2562                                1'h0
   4       R      reg_timer_4_toggle_state                    1'h0
   5       R      reg_timer_5_toggle_state                    1'h0
   6       R      reg_timer_6_toggle_state                    1'h0
   7       R      reg_timer_7_toggle_state                    1'h0
   8       R      reg_timer_8_toggle_state                    1'h0
   9       R      reg_timer_9_toggle_state                    1'h0
   10      R      RESERVED2555                                1'h0
   11      R      RESERVED2554                                1'h0
   12      R      RESERVED2553                                1'h0
   13      R      RESERVED2552                                1'h0
   14      R      RESERVED2551                                1'h0
   15      R      RESERVED2550                                1'h0
   16      R      RESERVED2549                                1'h0
   17      R      RESERVED2548                                1'h0
   18      R      RESERVED2547                                1'h0
   19      R      RESERVED2546                                1'h0
   20      R      RESERVED2545                                1'h0
   21      R      RESERVED2544                                1'h0
   22      R      RESERVED2543                                1'h0
   23      R      RESERVED2542                                1'h0
   24      R      RESERVED2541                                1'h0
   25      R      RESERVED2540                                1'h0
   26      R      RESERVED2539                                1'h0
   27      R      RESERVED2538                                1'h0
   28      R      RESERVED2537                                1'h0
   29      R      RESERVED2536                                1'h0
   30      R      RESERVED2535                                1'h0
   31      R      RESERVED2534                                1'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t reserved_31: 1;
        const uint32_t reserved_30: 1;
        const uint32_t reserved_29: 1;
        const uint32_t reserved_28: 1;
        const uint32_t reg_timer_4_toggle_state: 1;
        const uint32_t reg_timer_5_toggle_state: 1;
        const uint32_t reg_timer_6_toggle_state: 1;
        const uint32_t reg_timer_7_toggle_state: 1;
        const uint32_t reg_timer_8_toggle_state: 1;
        const uint32_t reg_timer_9_toggle_state: 1;
        const uint32_t reserved_21: 1;
        const uint32_t reserved_20: 1;
        const uint32_t reserved_19: 1;
        const uint32_t reserved_18: 1;
        const uint32_t reserved_17: 1;
        const uint32_t reserved_16: 1;
        const uint32_t reserved_15: 1;
        const uint32_t reserved_14: 1;
        const uint32_t reserved_13: 1;
        const uint32_t reserved_12: 1;
        const uint32_t reserved_11: 1;
        const uint32_t reserved_10: 1;
        const uint32_t reserved_9: 1;
        const uint32_t reserved_8: 1;
        const uint32_t reserved_7: 1;
        const uint32_t reserved_6: 1;
        const uint32_t reserved_5: 1;
        const uint32_t reserved_4: 1;
        const uint32_t reserved_3: 1;
        const uint32_t reserved_2: 1;
        const uint32_t reserved_1: 1;
        const uint32_t reserved_0: 1;
    } b;
} TIMER_PWM_STATE_TypeDef;


/* 0xA0C
   0       R/W    reg_timer_0_intr_en                         1'h0
   1       R/W    reg_timer_1_intr_en                         1'h0
   2       R/W    reg_timer_2_intr_en                         1'h0
   3       R/W    reg_timer_3_intr_en                         1'h0
   4       R/W    reg_timer_4_intr_en                         1'h0
   5       R/W    reg_timer_5_intr_en                         1'h0
   6       R/W    reg_timer_6_intr_en                         1'h0
   7       R/W    reg_timer_7_intr_en                         1'h0
   8       R/W    reg_timer_8_intr_en                         1'h0
   9       R/W    reg_timer_9_intr_en                         1'h0
   10      R      RESERVED2588                                1'h0
   11      R      RESERVED2587                                1'h0
   12      R      RESERVED2586                                1'h0
   13      R      RESERVED2585                                1'h0
   14      R      RESERVED2584                                1'h0
   15      R      RESERVED2583                                1'h0
   16      R      RESERVED2582                                1'h0
   17      R      RESERVED2581                                1'h0
   18      R      RESERVED2580                                1'h0
   19      R      RESERVED2579                                1'h0
   20      R      RESERVED2578                                1'h0
   21      R      RESERVED2577                                1'h0
   22      R      RESERVED2576                                1'h0
   23      R      RESERVED2575                                1'h0
   24      R      RESERVED2574                                1'h0
   25      R      RESERVED2573                                1'h0
   26      R      RESERVED2572                                1'h0
   27      R      RESERVED2571                                1'h0
   28      R      RESERVED2570                                1'h0
   29      R      RESERVED2569                                1'h0
   30      R      RESERVED2568                                1'h0
   31      R      RESERVED2567                                1'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        uint32_t reg_timer_0_intr_en: 1;
        uint32_t reg_timer_1_intr_en: 1;
        uint32_t reg_timer_2_intr_en: 1;
        uint32_t reg_timer_3_intr_en: 1;
        uint32_t reg_timer_4_intr_en: 1;
        uint32_t reg_timer_5_intr_en: 1;
        uint32_t reg_timer_6_intr_en: 1;
        uint32_t reg_timer_7_intr_en: 1;
        uint32_t reg_timer_8_intr_en: 1;
        uint32_t reg_timer_9_intr_en: 1;
        const uint32_t reserved_21: 1;
        const uint32_t reserved_20: 1;
        const uint32_t reserved_19: 1;
        const uint32_t reserved_18: 1;
        const uint32_t reserved_17: 1;
        const uint32_t reserved_16: 1;
        const uint32_t reserved_15: 1;
        const uint32_t reserved_14: 1;
        const uint32_t reserved_13: 1;
        const uint32_t reserved_12: 1;
        const uint32_t reserved_11: 1;
        const uint32_t reserved_10: 1;
        const uint32_t reserved_9: 1;
        const uint32_t reserved_8: 1;
        const uint32_t reserved_7: 1;
        const uint32_t reserved_6: 1;
        const uint32_t reserved_5: 1;
        const uint32_t reserved_4: 1;
        const uint32_t reserved_3: 1;
        const uint32_t reserved_2: 1;
        const uint32_t reserved_1: 1;
        const uint32_t reserved_0: 1;
    } b;
} TIMER_INTR_EN_CTRL_TypeDef;


/* 0xA10
   0       R/W1C  reg_timer_0_intr_sts                        1'h0
   1       R/W1C  reg_timer_1_intr_sts                        1'h0
   2       R/W1C  reg_timer_2_intr_sts                        1'h0
   3       R/W1C  reg_timer_3_intr_sts                        1'h0
   4       R/W1C  reg_timer_4_intr_sts                        1'h0
   5       R/W1C  reg_timer_5_intr_sts                        1'h0
   6       R/W1C  reg_timer_6_intr_sts                        1'h0
   7       R/W1C  reg_timer_7_intr_sts                        1'h0
   8       R/W1C  reg_timer_8_intr_sts                        1'h0
   9       R/W1C  reg_timer_9_intr_sts                        1'h0
   10      R      RESERVED2621                                1'h0
   11      R      RESERVED2620                                1'h0
   12      R      RESERVED2619                                1'h0
   13      R      RESERVED2618                                1'h0
   14      R      RESERVED2617                                1'h0
   15      R      RESERVED2616                                1'h0
   16      R      RESERVED2615                                1'h0
   17      R      RESERVED2614                                1'h0
   18      R      RESERVED2613                                1'h0
   19      R      RESERVED2612                                1'h0
   20      R      RESERVED2611                                1'h0
   21      R      RESERVED2610                                1'h0
   22      R      RESERVED2609                                1'h0
   23      R      RESERVED2608                                1'h0
   24      R      RESERVED2607                                1'h0
   25      R      RESERVED2606                                1'h0
   26      R      RESERVED2605                                1'h0
   27      R      RESERVED2604                                1'h0
   28      R      RESERVED2603                                1'h0
   29      R      RESERVED2602                                1'h0
   30      R      RESERVED2601                                1'h0
   31      R      RESERVED2600                                1'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        uint32_t reg_timer_0_intr_sts: 1;
        uint32_t reg_timer_1_intr_sts: 1;
        uint32_t reg_timer_2_intr_sts: 1;
        uint32_t reg_timer_3_intr_sts: 1;
        uint32_t reg_timer_4_intr_sts: 1;
        uint32_t reg_timer_5_intr_sts: 1;
        uint32_t reg_timer_6_intr_sts: 1;
        uint32_t reg_timer_7_intr_sts: 1;
        uint32_t reg_timer_8_intr_sts: 1;
        uint32_t reg_timer_9_intr_sts: 1;
        const uint32_t reserved_21: 1;
        const uint32_t reserved_20: 1;
        const uint32_t reserved_19: 1;
        const uint32_t reserved_18: 1;
        const uint32_t reserved_17: 1;
        const uint32_t reserved_16: 1;
        const uint32_t reserved_15: 1;
        const uint32_t reserved_14: 1;
        const uint32_t reserved_13: 1;
        const uint32_t reserved_12: 1;
        const uint32_t reserved_11: 1;
        const uint32_t reserved_10: 1;
        const uint32_t reserved_9: 1;
        const uint32_t reserved_8: 1;
        const uint32_t reserved_7: 1;
        const uint32_t reserved_6: 1;
        const uint32_t reserved_5: 1;
        const uint32_t reserved_4: 1;
        const uint32_t reserved_3: 1;
        const uint32_t reserved_2: 1;
        const uint32_t reserved_1: 1;
        const uint32_t reserved_0: 1;
    } b;
} TIMER_INTR_STS_TypeDef;


/* 0xA14
   0       R      reg_timer_0_intr_sts_masked                 1'h0
   1       R      reg_timer_1_intr_sts_masked                 1'h0
   2       R      reg_timer_2_intr_sts_masked                 1'h0
   3       R      reg_timer_3_intr_sts_masked                 1'h0
   4       R      reg_timer_4_intr_sts_masked                 1'h0
   5       R      reg_timer_5_intr_sts_masked                 1'h0
   6       R      reg_timer_6_intr_sts_masked                 1'h0
   7       R      reg_timer_7_intr_sts_masked                 1'h0
   8       R      reg_timer_8_intr_sts_masked                 1'h0
   9       R      reg_timer_9_intr_sts_masked                 1'h0
   10      R      RESERVED2654                                1'h0
   11      R      RESERVED2653                                1'h0
   12      R      RESERVED2652                                1'h0
   13      R      RESERVED2651                                1'h0
   14      R      RESERVED2650                                1'h0
   15      R      RESERVED2649                                1'h0
   16      R      RESERVED2648                                1'h0
   17      R      RESERVED2647                                1'h0
   18      R      RESERVED2646                                1'h0
   19      R      RESERVED2645                                1'h0
   20      R      RESERVED2644                                1'h0
   21      R      RESERVED2643                                1'h0
   22      R      RESERVED2642                                1'h0
   23      R      RESERVED2641                                1'h0
   24      R      RESERVED2640                                1'h0
   25      R      RESERVED2639                                1'h0
   26      R      RESERVED2638                                1'h0
   27      R      RESERVED2637                                1'h0
   28      R      RESERVED2636                                1'h0
   29      R      RESERVED2635                                1'h0
   30      R      RESERVED2634                                1'h0
   31      R      RESERVED2633                                1'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t reg_timer_0_intr_sts_masked: 1;
        const uint32_t reg_timer_1_intr_sts_masked: 1;
        const uint32_t reg_timer_2_intr_sts_masked: 1;
        const uint32_t reg_timer_3_intr_sts_masked: 1;
        const uint32_t reg_timer_4_intr_sts_masked: 1;
        const uint32_t reg_timer_5_intr_sts_masked: 1;
        const uint32_t reg_timer_6_intr_sts_masked: 1;
        const uint32_t reg_timer_7_intr_sts_masked: 1;
        const uint32_t reg_timer_8_intr_sts_masked: 1;
        const uint32_t reg_timer_9_intr_sts_masked: 1;
        const uint32_t reserved_21: 1;
        const uint32_t reserved_20: 1;
        const uint32_t reserved_19: 1;
        const uint32_t reserved_18: 1;
        const uint32_t reserved_17: 1;
        const uint32_t reserved_16: 1;
        const uint32_t reserved_15: 1;
        const uint32_t reserved_14: 1;
        const uint32_t reserved_13: 1;
        const uint32_t reserved_12: 1;
        const uint32_t reserved_11: 1;
        const uint32_t reserved_10: 1;
        const uint32_t reserved_9: 1;
        const uint32_t reserved_8: 1;
        const uint32_t reserved_7: 1;
        const uint32_t reserved_6: 1;
        const uint32_t reserved_5: 1;
        const uint32_t reserved_4: 1;
        const uint32_t reserved_3: 1;
        const uint32_t reserved_2: 1;
        const uint32_t reserved_1: 1;
        const uint32_t reserved_0: 1;
    } b;
} TIMER_INTR_TypeDef;


/* 0xA18
   0       R      RESERVED2697                                1'h0
   1       R      RESERVED2696                                1'h0
   2       R      RESERVED2695                                1'h0
   3       R      RESERVED2694                                1'h0
   4       R      RESERVED2693                                1'h0
   5       R      RESERVED2692                                1'h0
   6       R      reg_timer_6_ccr_fifo_empty                  1'h1
   7       R      reg_timer_7_ccr_fifo_empty                  1'h1
   8       R      reg_timer_8_ccr_fifo_empty                  1'h1
   9       R      reg_timer_9_ccr_fifo_empty                  1'h1
   10      R      RESERVED2687                                1'h0
   11      R      RESERVED2686                                1'h0
   12      R      RESERVED2685                                1'h0
   13      R      RESERVED2684                                1'h0
   14      R      RESERVED2683                                1'h0
   15      R      RESERVED2682                                1'h0
   16      R      RESERVED2681                                1'h0
   17      R      RESERVED2680                                1'h0
   18      R      RESERVED2679                                1'h0
   19      R      RESERVED2678                                1'h0
   20      R      RESERVED2677                                1'h0
   21      R      RESERVED2676                                1'h0
   22      R      RESERVED2675                                1'h0
   23      R      RESERVED2674                                1'h0
   24      R      RESERVED2673                                1'h0
   25      R      RESERVED2672                                1'h0
   26      R      RESERVED2671                                1'h0
   27      R      RESERVED2670                                1'h0
   28      R      RESERVED2669                                1'h0
   29      R      RESERVED2668                                1'h0
   30      R      RESERVED2667                                1'h0
   31      R      RESERVED2666                                1'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t reserved_27: 1;
        const uint32_t reserved_26: 1;
        const uint32_t reserved_25: 1;
        const uint32_t reserved_24: 1;
        const uint32_t reserved_23: 1;
        const uint32_t reserved_22: 1;
        const uint32_t reg_timer_6_ccr_fifo_empty: 1;
        const uint32_t reg_timer_7_ccr_fifo_empty: 1;
        const uint32_t reg_timer_8_ccr_fifo_empty: 1;
        const uint32_t reg_timer_9_ccr_fifo_empty: 1;
        const uint32_t reserved_21: 1;
        const uint32_t reserved_20: 1;
        const uint32_t reserved_19: 1;
        const uint32_t reserved_18: 1;
        const uint32_t reserved_17: 1;
        const uint32_t reserved_16: 1;
        const uint32_t reserved_15: 1;
        const uint32_t reserved_14: 1;
        const uint32_t reserved_13: 1;
        const uint32_t reserved_12: 1;
        const uint32_t reserved_11: 1;
        const uint32_t reserved_10: 1;
        const uint32_t reserved_9: 1;
        const uint32_t reserved_8: 1;
        const uint32_t reserved_7: 1;
        const uint32_t reserved_6: 1;
        const uint32_t reserved_5: 1;
        const uint32_t reserved_4: 1;
        const uint32_t reserved_3: 1;
        const uint32_t reserved_2: 1;
        const uint32_t reserved_1: 1;
        const uint32_t reserved_0: 1;
    } b;
} TIMER_CCR_FIFO_EMPTY_STS_TypeDef;


/* 0xA1C
   0       R      RESERVED2730                                1'h0
   1       R      RESERVED2729                                1'h0
   2       R      RESERVED2728                                1'h0
   3       R      RESERVED2727                                1'h0
   4       R      RESERVED2726                                1'h0
   5       R      RESERVED2725                                1'h0
   6       R      reg_timer_6_ccr_fifo_full                   1'h0
   7       R      reg_timer_7_ccr_fifo_full                   1'h0
   8       R      reg_timer_8_ccr_fifo_full                   1'h0
   9       R      reg_timer_9_ccr_fifo_full                   1'h0
   10      R      RESERVED2720                                1'h0
   11      R      RESERVED2719                                1'h0
   12      R      RESERVED2718                                1'h0
   13      R      RESERVED2717                                1'h0
   14      R      RESERVED2716                                1'h0
   15      R      RESERVED2715                                1'h0
   16      R      RESERVED2714                                1'h0
   17      R      RESERVED2713                                1'h0
   18      R      RESERVED2712                                1'h0
   19      R      RESERVED2711                                1'h0
   20      R      RESERVED2710                                1'h0
   21      R      RESERVED2709                                1'h0
   22      R      RESERVED2708                                1'h0
   23      R      RESERVED2707                                1'h0
   24      R      RESERVED2706                                1'h0
   25      R      RESERVED2705                                1'h0
   26      R      RESERVED2704                                1'h0
   27      R      RESERVED2703                                1'h0
   28      R      RESERVED2702                                1'h0
   29      R      RESERVED2701                                1'h0
   30      R      RESERVED2700                                1'h0
   31      R      RESERVED2699                                1'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t reserved_27: 1;
        const uint32_t reserved_26: 1;
        const uint32_t reserved_25: 1;
        const uint32_t reserved_24: 1;
        const uint32_t reserved_23: 1;
        const uint32_t reserved_22: 1;
        const uint32_t reg_timer_6_ccr_fifo_full: 1;
        const uint32_t reg_timer_7_ccr_fifo_full: 1;
        const uint32_t reg_timer_8_ccr_fifo_full: 1;
        const uint32_t reg_timer_9_ccr_fifo_full: 1;
        const uint32_t reserved_21: 1;
        const uint32_t reserved_20: 1;
        const uint32_t reserved_19: 1;
        const uint32_t reserved_18: 1;
        const uint32_t reserved_17: 1;
        const uint32_t reserved_16: 1;
        const uint32_t reserved_15: 1;
        const uint32_t reserved_14: 1;
        const uint32_t reserved_13: 1;
        const uint32_t reserved_12: 1;
        const uint32_t reserved_11: 1;
        const uint32_t reserved_10: 1;
        const uint32_t reserved_9: 1;
        const uint32_t reserved_8: 1;
        const uint32_t reserved_7: 1;
        const uint32_t reserved_6: 1;
        const uint32_t reserved_5: 1;
        const uint32_t reserved_4: 1;
        const uint32_t reserved_3: 1;
        const uint32_t reserved_2: 1;
        const uint32_t reserved_1: 1;
        const uint32_t reserved_0: 1;
    } b;
} TIMER_CCR_FIFO_FULL_STS_TypeDef;


