wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/io/rtl876x_tim_def.h
/* 0xA20
   0       R      RESERVED2763                              1'h0
   1       R      RESERVED2762                              1'h0
   2       R      RESERVED2761                              1'h0
   3       R      RESERVED2760                              1'h0
   4       R      RESERVED2759                              1'h0
   5       R      RESERVED2758                              1'h0
   6       R      RESERVED2757                              1'h0
   7       R      RESERVED2756                              1'h0
   8       R      RESERVED2755                              1'h0
   9       R/W    reg_timer_9_latch_cnt_0_fifo_full_intr_en 1'h0
   10      R      RESERVED2753                              1'h0
   11      R      RESERVED2752                              1'h0
   12      R      RESERVED2751                              1'h0
   13      R      RESERVED2750                              1'h0
   14      R      RESERVED2749                              1'h0
   15      R      RESERVED2748                              1'h0
   16      R      RESERVED2747                              1'h0
   17      R      RESERVED2746                              1'h0
   18      R      RESERVED2745                              1'h0
   19      R      RESERVED2744                              1'h0
   20      R      RESERVED2743                              1'h0
   21      R      RESERVED2742                              1'h0
   22      R      RESERVED2741                              1'h0
   23      R      RESERVED2740                              1'h0
   24      R      RESERVED2739                              1'h0
   25      R      RESERVED2738                              1'h0
   26      R      RESERVED2737                              1'h0
   27      R      RESERVED2736                              1'h0
   28      R      RESERVED2735                              1'h0
   29      R      RESERVED2734                              1'h0
   30      R      RESERVED2733                              1'h0
   31      R      RESERVED2732                              1'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t reserved_31: 1;
        const uint32_t reserved_30: 1;
        const uint32_t reserved_29: 1;
        const uint32_t reserved_28: 1;
        const uint32_t reserved_27: 1;
        const uint32_t reserved_26: 1;
        const uint32_t reserved_25: 1;
        const uint32_t reserved_24: 1;
        const uint32_t reserved_23: 1;
        uint32_t reg_timer_9_latch_cnt_0_fifo_full_intr_en: 1;
        const uint32_t reserved_21: 1;
        const uint32_t reserved_20: 1;
        const uint32_t reserved_19: 1;
        const uint32_t reserved_18: 1;
        const uint32_t reserved_17: 1;
        const uint32_t reserved_16: 1;
        const uint32_t reserved_15: 1;
        const uint32_t reserved_14: 1;
        const uint32_t reserved_13: 1;
        const uint32_t reserved_12: 1;
        const uint32_t reserved_11: 1;
        const uint32_t reserved_10: 1;
        const uint32_t reserved_9: 1;
        const uint32_t reserved_8: 1;
        const uint32_t reserved_7: 1;
        const uint32_t reserved_6: 1;
        const uint32_t reserved_5: 1;
        const uint32_t reserved_4: 1;
        const uint32_t reserved_3: 1;
        const uint32_t reserved_2: 1;
        const uint32_t reserved_1: 1;
        const uint32_t reserved_0: 1;
    } b;
} TIMER_LAT_CNT_0_FIFO_FULL_INTR_EN_CTRL_TypeDef;


/* 0xA24
   0       R      RESERVED2796                                1'h0
   1       R      RESERVED2795                                1'h0
   2       R      RESERVED2794                                1'h0
   3       R      RESERVED2793                                1'h0
   4       R      RESERVED2792                                1'h0
   5       R      RESERVED2791                                1'h0
   6       R      RESERVED2790                                1'h0
   7       R      RESERVED2789                                1'h0
   8       R      RESERVED2788                                1'h0
   9       R/W    reg_timer_9_latch_cnt_0_fifo_met_th_intr_en 1'h0
   10      R      RESERVED2786                                1'h0
   11      R      RESERVED2785                                1'h0
   12      R      RESERVED2784                                1'h0
   13      R      RESERVED2783                                1'h0
   14      R      RESERVED2782                                1'h0
   15      R      RESERVED2781                                1'h0
   16      R      RESERVED2780                                1'h0
   17      R      RESERVED2779                                1'h0
   18      R      RESERVED2778                                1'h0
   19      R      RESERVED2777                                1'h0
   20      R      RESERVED2776                                1'h0
   21      R      RESERVED2775                                1'h0
   22      R      RESERVED2774                                1'h0
   23      R      RESERVED2773                                1'h0
   24      R      RESERVED2772                                1'h0
   25      R      RESERVED2771                                1'h0
   26      R      RESERVED2770                                1'h0
   27      R      RESERVED2769                                1'h0
   28      R      RESERVED2768                                1'h0
   29      R      RESERVED2767                                1'h0
   30      R      RESERVED2766                                1'h0
   31      R      RESERVED2765                                1'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t reserved_31: 1;
        const uint32_t reserved_30: 1;
        const uint32_t reserved_29: 1;
        const uint32_t reserved_28: 1;
        const uint32_t reserved_27: 1;
        const uint32_t reserved_26: 1;
        const uint32_t reserved_25: 1;
        const uint32_t reserved_24: 1;
        const uint32_t reserved_23: 1;
        uint32_t reg_timer_9_latch_cnt_0_fifo_met_th_intr_en: 1;
        const uint32_t reserved_21: 1;
        const uint32_t reserved_20: 1;
        const uint32_t reserved_19: 1;
        const uint32_t reserved_18: 1;
        const uint32_t reserved_17: 1;
        const uint32_t reserved_16: 1;
        const uint32_t reserved_15: 1;
        const uint32_t reserved_14: 1;
        const uint32_t reserved_13: 1;
        const uint32_t reserved_12: 1;
        const uint32_t reserved_11: 1;
        const uint32_t reserved_10: 1;
        const uint32_t reserved_9: 1;
        const uint32_t reserved_8: 1;
        const uint32_t reserved_7: 1;
        const uint32_t reserved_6: 1;
        const uint32_t reserved_5: 1;
        const uint32_t reserved_4: 1;
        const uint32_t reserved_3: 1;
        const uint32_t reserved_2: 1;
        const uint32_t reserved_1: 1;
        const uint32_t reserved_0: 1;
    } b;
} TIMER_LAT_CNT_0_FIFO_MET_THRESHOLD_INTR_EN_CTRL_TypeDef;


/* 0xA28
   0       R      RESERVED2829                              1'h1
   1       R      RESERVED2828                              1'h1
   2       R      RESERVED2827                              1'h1
   3       R      RESERVED2826                              1'h1
   4       R      RESERVED2825                              1'h1
   5       R      RESERVED2824                              1'h1
   6       R      RESERVED2823                              1'h1
   7       R      RESERVED2822                              1'h1
   8       R      RESERVED2821                              1'h1
   9       R      reg_timer_9_latch_cnt_0_fifo_empty        1'h1
   10      R      RESERVED2819                              1'h1
   11      R      RESERVED2818                              1'h1
   12      R      RESERVED2817                              1'h1
   13      R      RESERVED2816                              1'h1
   14      R      RESERVED2815                              1'h1
   15      R      RESERVED2814                              1'h1
   16      R      RESERVED2813                              1'h1
   17      R      RESERVED2812                              1'h1
   18      R      RESERVED2811                              1'h1
   19      R      RESERVED2810                              1'h1
   20      R      RESERVED2809                              1'h1
   21      R      RESERVED2808                              1'h1
   22      R      RESERVED2807                              1'h1
   23      R      RESERVED2806                              1'h1
   24      R      RESERVED2805                              1'h1
   25      R      RESERVED2804                              1'h1
   26      R      RESERVED2803                              1'h1
   27      R      RESERVED2802                              1'h1
   28      R      RESERVED2801                              1'h1
   29      R      RESERVED2800                              1'h1
   30      R      RESERVED2799                              1'h1
   31      R      RESERVED2798                              1'h1
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t reserved_31: 1;
        const uint32_t reserved_30: 1;
        const uint32_t reserved_29: 1;
        const uint32_t reserved_28: 1;
        const uint32_t reserved_27: 1;
        const uint32_t reserved_26: 1;
        const uint32_t reserved_25: 1;
        const uint32_t reserved_24: 1;
        const uint32_t reserved_23: 1;
        const uint32_t reg_timer_9_latch_cnt_0_fifo_empty: 1;
        const uint32_t reserved_21: 1;
        const uint32_t reserved_20: 1;
        const uint32_t reserved_19: 1;
        const uint32_t reserved_18: 1;
        const uint32_t reserved_17: 1;
        const uint32_t reserved_16: 1;
        const uint32_t reserved_15: 1;
        const uint32_t reserved_14: 1;
        const uint32_t reserved_13: 1;
        const uint32_t reserved_12: 1;
        const uint32_t reserved_11: 1;
        const uint32_t reserved_10: 1;
        const uint32_t reserved_9: 1;
        const uint32_t reserved_8: 1;
        const uint32_t reserved_7: 1;
        const uint32_t reserved_6: 1;
        const uint32_t reserved_5: 1;
        const uint32_t reserved_4: 1;
        const uint32_t reserved_3: 1;
        const uint32_t reserved_2: 1;
        const uint32_t reserved_1: 1;
        const uint32_t reserved_0: 1;
    } b;
} TIMER_LAT_CNT_0_FIFO_EMPTY_STS_TypeDef;


/* 0xA2C
   0       R      RESERVED2862                              1'h0
   1       R      RESERVED2861                              1'h0
   2       R      RESERVED2860                              1'h0
   3       R      RESERVED2859                              1'h0
   4       R      RESERVED2858                              1'h0
   5       R      RESERVED2857                              1'h0
   6       R      RESERVED2856                              1'h0
   7       R      RESERVED2855                              1'h0
   8       R      RESERVED2854                              1'h0
   9       R/W1C  reg_timer_9_latch_cnt_0_fifo_full         1'h0
   10      R      RESERVED2852                              1'h0
   11      R      RESERVED2851                              1'h0
   12      R      RESERVED2850                              1'h0
   13      R      RESERVED2849                              1'h0
   14      R      RESERVED2848                              1'h0
   15      R      RESERVED2847                              1'h0
   16      R      RESERVED2846                              1'h0
   17      R      RESERVED2845                              1'h0
   18      R      RESERVED2844                              1'h0
   19      R      RESERVED2843                              1'h0
   20      R      RESERVED2842                              1'h0
   21      R      RESERVED2841                              1'h0
   22      R      RESERVED2840                              1'h0
   23      R      RESERVED2839                              1'h0
   24      R      RESERVED2838                              1'h0
   25      R      RESERVED2837                              1'h0
   26      R      RESERVED2836                              1'h0
   27      R      RESERVED2835                              1'h0
   28      R      RESERVED2834                              1'h0
   29      R      RESERVED2833                              1'h0
   30      R      RESERVED2832                              1'h0
   31      R      RESERVED2831                              1'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t reserved_31: 1;
        const uint32_t reserved_30: 1;
        const uint32_t reserved_29: 1;
        const uint32_t reserved_28: 1;
        const uint32_t reserved_27: 1;
        const uint32_t reserved_26: 1;
        const uint32_t reserved_25: 1;
        const uint32_t reserved_24: 1;
        const uint32_t reserved_23: 1;
        uint32_t reg_timer_9_latch_cnt_0_fifo_full: 1;
        const uint32_t reserved_21: 1;
        const uint32_t reserved_20: 1;
        const uint32_t reserved_19: 1;
        const uint32_t reserved_18: 1;
        const uint32_t reserved_17: 1;
        const uint32_t reserved_16: 1;
        const uint32_t reserved_15: 1;
        const uint32_t reserved_14: 1;
        const uint32_t reserved_13: 1;
        const uint32_t reserved_12: 1;
        const uint32_t reserved_11: 1;
        const uint32_t reserved_10: 1;
        const uint32_t reserved_9: 1;
        const uint32_t reserved_8: 1;
        const uint32_t reserved_7: 1;
        const uint32_t reserved_6: 1;
        const uint32_t reserved_5: 1;
        const uint32_t reserved_4: 1;
        const uint32_t reserved_3: 1;
        const uint32_t reserved_2: 1;
        const uint32_t reserved_1: 1;
        const uint32_t reserved_0: 1;
    } b;
} TIMER_LAT_CNT_0_FIFO_FULL_INTR_TypeDef;


/* 0xA30
   0       R      RESERVED2895                              1'h0
   1       R      RESERVED2894                              1'h0
   2       R      RESERVED2893                              1'h0
   3       R      RESERVED2892                              1'h0
   4       R      RESERVED2891                              1'h0
   5       R      RESERVED2890                              1'h0
   6       R      RESERVED2889                              1'h0
   7       R      RESERVED2888                              1'h0
   8       R      RESERVED2887                              1'h0
   9       R/W1C  reg_timer_9_latch_cnt_0_fifo_met_th       1'h0
   10      R      RESERVED2885                              1'h0
   11      R      RESERVED2884                              1'h0
   12      R      RESERVED2883                              1'h0
   13      R      RESERVED2882                              1'h0
   14      R      RESERVED2881                              1'h0
   15      R      RESERVED2880                              1'h0
   16      R      RESERVED2879                              1'h0
   17      R      RESERVED2878                              1'h0
   18      R      RESERVED2877                              1'h0
   19      R      RESERVED2876                              1'h0
   20      R      RESERVED2875                              1'h0
   21      R      RESERVED2874                              1'h0
   22      R      RESERVED2873                              1'h0
   23      R      RESERVED2872                              1'h0
   24      R      RESERVED2871                              1'h0
   25      R      RESERVED2870                              1'h0
   26      R      RESERVED2869                              1'h0
   27      R      RESERVED2868                              1'h0
   28      R      RESERVED2867                              1'h0
   29      R      RESERVED2866                              1'h0
   30      R      RESERVED2865                              1'h0
   31      R      RESERVED2864                              1'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t reserved_31: 1;
        const uint32_t reserved_30: 1;
        const uint32_t reserved_29: 1;
        const uint32_t reserved_28: 1;
        const uint32_t reserved_27: 1;
        const uint32_t reserved_26: 1;
        const uint32_t reserved_25: 1;
        const uint32_t reserved_24: 1;
        const uint32_t reserved_23: 1;
        uint32_t reg_timer_9_latch_cnt_0_fifo_met_th: 1;
        const uint32_t reserved_21: 1;
        const uint32_t reserved_20: 1;
        const uint32_t reserved_19: 1;
        const uint32_t reserved_18: 1;
        const uint32_t reserved_17: 1;
        const uint32_t reserved_16: 1;
        const uint32_t reserved_15: 1;
        const uint32_t reserved_14: 1;
        const uint32_t reserved_13: 1;
        const uint32_t reserved_12: 1;
        const uint32_t reserved_11: 1;
        const uint32_t reserved_10: 1;
        const uint32_t reserved_9: 1;
        const uint32_t reserved_8: 1;
        const uint32_t reserved_7: 1;
        const uint32_t reserved_6: 1;
        const uint32_t reserved_5: 1;
        const uint32_t reserved_4: 1;
        const uint32_t reserved_3: 1;
        const uint32_t reserved_2: 1;
        const uint32_t reserved_1: 1;
        const uint32_t reserved_0: 1;
    } b;
} TIMER_LAT_CNT_0_FIFO_MET_THRESHOLD_INTR_TypeDef;


