wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/io/rtl876x_tim_def.h
/* 0xA34
   0       R      RESERVED2928                                1'h0
   1       R      RESERVED2927                                1'h0
   2       R      RESERVED2926                                1'h0
   3       R      RESERVED2925                                1'h0
   4       R      RESERVED2924                                1'h0
   5       R      RESERVED2923                                1'h0
   6       R      RESERVED2922                                1'h0
   7       R      RESERVED2921                                1'h0
   8       R      RESERVED2920                                1'h0
   9       R      RESERVED2919                                1'h0
   10      R      RESERVED2918                                1'h0
   11      R      RESERVED2917                                1'h0
   12      R      RESERVED2916                                1'h0
   13      R      RESERVED2915                                1'h0
   14      R      RESERVED2914                                1'h0
   15      R      RESERVED2913                                1'h0
   16      R      RESERVED2912                                1'h0
   17      R      RESERVED2911                                1'h0
   18      R      RESERVED2910                                1'h0
   19      R      RESERVED2909                                1'h0
   20      R      RESERVED2908                                1'h0
   21      R      RESERVED2907                                1'h0
   22      R      RESERVED2906                                1'h0
   23      R      RESERVED2905                                1'h0
   24      R      RESERVED2904                                1'h0
   25      R      RESERVED2903                                1'h0
   26      R      RESERVED2902                                1'h0
   27      R      RESERVED2901                                1'h0
   28      R      RESERVED2900                                1'h0
   29      R      RESERVED2899                                1'h0
   30      R      RESERVED2898                                1'h0
   31      R      RESERVED2897                                1'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t reserved_31: 1;
        const uint32_t reserved_30: 1;
        const uint32_t reserved_29: 1;
        const uint32_t reserved_28: 1;
        const uint32_t reserved_27: 1;
        const uint32_t reserved_26: 1;
        const uint32_t reserved_25: 1;
        const uint32_t reserved_24: 1;
        const uint32_t reserved_23: 1;
        const uint32_t reserved_22: 1;
        const uint32_t reserved_21: 1;
        const uint32_t reserved_20: 1;
        const uint32_t reserved_19: 1;
        const uint32_t reserved_18: 1;
        const uint32_t reserved_17: 1;
        const uint32_t reserved_16: 1;
        const uint32_t reserved_15: 1;
        const uint32_t reserved_14: 1;
        const uint32_t reserved_13: 1;
        const uint32_t reserved_12: 1;
        const uint32_t reserved_11: 1;
        const uint32_t reserved_10: 1;
        const uint32_t reserved_9: 1;
        const uint32_t reserved_8: 1;
        const uint32_t reserved_7: 1;
        const uint32_t reserved_6: 1;
        const uint32_t reserved_5: 1;
        const uint32_t reserved_4: 1;
        const uint32_t reserved_3: 1;
        const uint32_t reserved_2: 1;
        const uint32_t reserved_1: 1;
        const uint32_t reserved_0: 1;
    } b;
} TIMER_LAT_CNT_1_FIFO_FULL_INTR_EN_CTRL_TypeDef;


/* 0xA38
   0       R      RESERVED2961                                1'h0
   1       R      RESERVED2960                                1'h0
   2       R      RESERVED2959                                1'h0
   3       R      RESERVED2958                                1'h0
   4       R      RESERVED2957                                1'h0
   5       R      RESERVED2956                                1'h0
   6       R      RESERVED2955                                1'h0
   7       R      RESERVED2954                                1'h0
   8       R      RESERVED2953                                1'h0
   9       R      RESERVED2952                                1'h0
   10      R      RESERVED2951                                1'h0
   11      R      RESERVED2950                                1'h0
   12      R      RESERVED2949                                1'h0
   13      R      RESERVED2948                                1'h0
   14      R      RESERVED2947                                1'h0
   15      R      RESERVED2946                                1'h0
   16      R      RESERVED2945                                1'h0
   17      R      RESERVED2944                                1'h0
   18      R      RESERVED2943                                1'h0
   19      R      RESERVED2942                                1'h0
   20      R      RESERVED2941                                1'h0
   21      R      RESERVED2940                                1'h0
   22      R      RESERVED2939                                1'h0
   23      R      RESERVED2938                                1'h0
   24      R      RESERVED2937                                1'h0
   25      R      RESERVED2936                                1'h0
   26      R      RESERVED2935                                1'h0
   27      R      RESERVED2934                                1'h0
   28      R      RESERVED2933                                1'h0
   29      R      RESERVED2932                                1'h0
   30      R      RESERVED2931                                1'h0
   31      R      RESERVED2930                                1'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t reserved_31: 1;
        const uint32_t reserved_30: 1;
        const uint32_t reserved_29: 1;
        const uint32_t reserved_28: 1;
        const uint32_t reserved_27: 1;
        const uint32_t reserved_26: 1;
        const uint32_t reserved_25: 1;
        const uint32_t reserved_24: 1;
        const uint32_t reserved_23: 1;
        const uint32_t reserved_22: 1;
        const uint32_t reserved_21: 1;
        const uint32_t reserved_20: 1;
        const uint32_t reserved_19: 1;
        const uint32_t reserved_18: 1;
        const uint32_t reserved_17: 1;
        const uint32_t reserved_16: 1;
        const uint32_t reserved_15: 1;
        const uint32_t reserved_14: 1;
        const uint32_t reserved_13: 1;
        const uint32_t reserved_12: 1;
        const uint32_t reserved_11: 1;
        const uint32_t reserved_10: 1;
        const uint32_t reserved_9: 1;
        const uint32_t reserved_8: 1;
        const uint32_t reserved_7: 1;
        const uint32_t reserved_6: 1;
        const uint32_t reserved_5: 1;
        const uint32_t reserved_4: 1;
        const uint32_t reserved_3: 1;
        const uint32_t reserved_2: 1;
        const uint32_t reserved_1: 1;
        const uint32_t reserved_0: 1;
    } b;
} TIMER_LAT_CNT_1_FIFO_MET_THRESHOLD_INTR_EN_CTRL_TypeDef;


/* 0xA3C
   0       R      RESERVED2994                                1'h1
   1       R      RESERVED2993                                1'h1
   2       R      RESERVED2992                                1'h1
   3       R      RESERVED2991                                1'h1
   4       R      RESERVED2990                                1'h1
   5       R      RESERVED2989                                1'h1
   6       R      RESERVED2988                                1'h1
   7       R      RESERVED2987                                1'h1
   8       R      RESERVED2986                                1'h1
   9       R      RESERVED2985                                1'h1
   10      R      RESERVED2984                                1'h1
   11      R      RESERVED2983                                1'h1
   12      R      RESERVED2982                                1'h1
   13      R      RESERVED2981                                1'h1
   14      R      RESERVED2980                                1'h1
   15      R      RESERVED2979                                1'h1
   16      R      RESERVED2978                                1'h1
   17      R      RESERVED2977                                1'h1
   18      R      RESERVED2976                                1'h1
   19      R      RESERVED2975                                1'h1
   20      R      RESERVED2974                                1'h1
   21      R      RESERVED2973                                1'h1
   22      R      RESERVED2972                                1'h1
   23      R      RESERVED2971                                1'h1
   24      R      RESERVED2970                                1'h1
   25      R      RESERVED2969                                1'h1
   26      R      RESERVED2968                                1'h1
   27      R      RESERVED2967                                1'h1
   28      R      RESERVED2966                                1'h1
   29      R      RESERVED2965                                1'h1
   30      R      RESERVED2964                                1'h1
   31      R      RESERVED2963                                1'h1
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t reserved_31: 1;
        const uint32_t reserved_30: 1;
        const uint32_t reserved_29: 1;
        const uint32_t reserved_28: 1;
        const uint32_t reserved_27: 1;
        const uint32_t reserved_26: 1;
        const uint32_t reserved_25: 1;
        const uint32_t reserved_24: 1;
        const uint32_t reserved_23: 1;
        const uint32_t reserved_22: 1;
        const uint32_t reserved_21: 1;
        const uint32_t reserved_20: 1;
        const uint32_t reserved_19: 1;
        const uint32_t reserved_18: 1;
        const uint32_t reserved_17: 1;
        const uint32_t reserved_16: 1;
        const uint32_t reserved_15: 1;
        const uint32_t reserved_14: 1;
        const uint32_t reserved_13: 1;
        const uint32_t reserved_12: 1;
        const uint32_t reserved_11: 1;
        const uint32_t reserved_10: 1;
        const uint32_t reserved_9: 1;
        const uint32_t reserved_8: 1;
        const uint32_t reserved_7: 1;
        const uint32_t reserved_6: 1;
        const uint32_t reserved_5: 1;
        const uint32_t reserved_4: 1;
        const uint32_t reserved_3: 1;
        const uint32_t reserved_2: 1;
        const uint32_t reserved_1: 1;
        const uint32_t reserved_0: 1;
    } b;
} TIMER_LAT_CNT_1_FIFO_EMPTY_STS_TypeDef;


/* 0xA40
   0       R      RESERVED3027                                1'h0
   1       R      RESERVED3026                                1'h0
   2       R      RESERVED3025                                1'h0
   3       R      RESERVED3024                                1'h0
   4       R      RESERVED3023                                1'h0
   5       R      RESERVED3022                                1'h0
   6       R      RESERVED3021                                1'h0
   7       R      RESERVED3020                                1'h0
   8       R      RESERVED3019                                1'h0
   9       R      RESERVED3018                                1'h0
   10      R      RESERVED3017                                1'h0
   11      R      RESERVED3016                                1'h0
   12      R      RESERVED3015                                1'h0
   13      R      RESERVED3014                                1'h0
   14      R      RESERVED3013                                1'h0
   15      R      RESERVED3012                                1'h0
   16      R      RESERVED3011                                1'h0
   17      R      RESERVED3010                                1'h0
   18      R      RESERVED3009                                1'h0
   19      R      RESERVED3008                                1'h0
   20      R      RESERVED3007                                1'h0
   21      R      RESERVED3006                                1'h0
   22      R      RESERVED3005                                1'h0
   23      R      RESERVED3004                                1'h0
   24      R      RESERVED3003                                1'h0
   25      R      RESERVED3002                                1'h0
   26      R      RESERVED3001                                1'h0
   27      R      RESERVED3000                                1'h0
   28      R      RESERVED2999                                1'h0
   29      R      RESERVED2998                                1'h0
   30      R      RESERVED2997                                1'h0
   31      R      RESERVED2996                                1'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t reserved_31: 1;
        const uint32_t reserved_30: 1;
        const uint32_t reserved_29: 1;
        const uint32_t reserved_28: 1;
        const uint32_t reserved_27: 1;
        const uint32_t reserved_26: 1;
        const uint32_t reserved_25: 1;
        const uint32_t reserved_24: 1;
        const uint32_t reserved_23: 1;
        const uint32_t reserved_22: 1;
        const uint32_t reserved_21: 1;
        const uint32_t reserved_20: 1;
        const uint32_t reserved_19: 1;
        const uint32_t reserved_18: 1;
        const uint32_t reserved_17: 1;
        const uint32_t reserved_16: 1;
        const uint32_t reserved_15: 1;
        const uint32_t reserved_14: 1;
        const uint32_t reserved_13: 1;
        const uint32_t reserved_12: 1;
        const uint32_t reserved_11: 1;
        const uint32_t reserved_10: 1;
        const uint32_t reserved_9: 1;
        const uint32_t reserved_8: 1;
        const uint32_t reserved_7: 1;
        const uint32_t reserved_6: 1;
        const uint32_t reserved_5: 1;
        const uint32_t reserved_4: 1;
        const uint32_t reserved_3: 1;
        const uint32_t reserved_2: 1;
        const uint32_t reserved_1: 1;
        const uint32_t reserved_0: 1;
    } b;
} TIMER_LAT_CNT_1_FIFO_FULL_INTR_TypeDef;


/* 0xA44
   0       R      RESERVED3060                                1'h0
   1       R      RESERVED3059                                1'h0
   2       R      RESERVED3058                                1'h0
   3       R      RESERVED3057                                1'h0
   4       R      RESERVED3056                                1'h0
   5       R      RESERVED3055                                1'h0
   6       R      RESERVED3054                                1'h0
   7       R      RESERVED3053                                1'h0
   8       R      RESERVED3052                                1'h0
   9       R      RESERVED3051                                1'h0
   10      R      RESERVED3050                                1'h0
   11      R      RESERVED3049                                1'h0
   12      R      RESERVED3048                                1'h0
   13      R      RESERVED3047                                1'h0
   14      R      RESERVED3046                                1'h0
   15      R      RESERVED3045                                1'h0
   16      R      RESERVED3044                                1'h0
   17      R      RESERVED3043                                1'h0
   18      R      RESERVED3042                                1'h0
   19      R      RESERVED3041                                1'h0
   20      R      RESERVED3040                                1'h0
   21      R      RESERVED3039                                1'h0
   22      R      RESERVED3038                                1'h0
   23      R      RESERVED3037                                1'h0
   24      R      RESERVED3036                                1'h0
   25      R      RESERVED3035                                1'h0
   26      R      RESERVED3034                                1'h0
   27      R      RESERVED3033                                1'h0
   28      R      RESERVED3032                                1'h0
   29      R      RESERVED3031                                1'h0
   30      R      RESERVED3030                                1'h0
   31      R      RESERVED3029                                1'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t reserved_31: 1;
        const uint32_t reserved_30: 1;
        const uint32_t reserved_29: 1;
        const uint32_t reserved_28: 1;
        const uint32_t reserved_27: 1;
        const uint32_t reserved_26: 1;
        const uint32_t reserved_25: 1;
        const uint32_t reserved_24: 1;
        const uint32_t reserved_23: 1;
        const uint32_t reserved_22: 1;
        const uint32_t reserved_21: 1;
        const uint32_t reserved_20: 1;
        const uint32_t reserved_19: 1;
        const uint32_t reserved_18: 1;
        const uint32_t reserved_17: 1;
        const uint32_t reserved_16: 1;
        const uint32_t reserved_15: 1;
        const uint32_t reserved_14: 1;
        const uint32_t reserved_13: 1;
        const uint32_t reserved_12: 1;
        const uint32_t reserved_11: 1;
        const uint32_t reserved_10: 1;
        const uint32_t reserved_9: 1;
        const uint32_t reserved_8: 1;
        const uint32_t reserved_7: 1;
        const uint32_t reserved_6: 1;
        const uint32_t reserved_5: 1;
        const uint32_t reserved_4: 1;
        const uint32_t reserved_3: 1;
        const uint32_t reserved_2: 1;
        const uint32_t reserved_1: 1;
        const uint32_t reserved_0: 1;
    } b;
} TIMER_LAT_CNT_1_FIFO_MET_THRESHOLD_INTR_TypeDef;


