wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/io/rtl876x_tim_def.h
/* 0xA48
   0       R      RESERVED3093                                1'h0
   1       R      RESERVED3092                                1'h0
   2       R      RESERVED3091                                1'h0
   3       R      RESERVED3090                                1'h0
   4       R      RESERVED3089                                1'h0
   5       R      RESERVED3088                                1'h0
   6       R      RESERVED3087                                1'h0
   7       R      RESERVED3086                                1'h0
   8       R      RESERVED3085                                1'h0
   9       R      RESERVED3084                                1'h0
   10      R      RESERVED3083                                1'h0
   11      R      RESERVED3082                                1'h0
   12      R      RESERVED3081                                1'h0
   13      R      RESERVED3080                                1'h0
   14      R      RESERVED3079                                1'h0
   15      R      RESERVED3078                                1'h0
   16      R      RESERVED3077                                1'h0
   17      R      RESERVED3076                                1'h0
   18      R      RESERVED3075                                1'h0
   19      R      RESERVED3074                                1'h0
   20      R      RESERVED3073                                1'h0
   21      R      RESERVED3072                                1'h0
   22      R      RESERVED3071                                1'h0
   23      R      RESERVED3070                                1'h0
   24      R      RESERVED3069                                1'h0
   25      R      RESERVED3068                                1'h0
   26      R      RESERVED3067                                1'h0
   27      R      RESERVED3066                                1'h0
   28      R      RESERVED3065                                1'h0
   29      R      RESERVED3064                                1'h0
   30      R      RESERVED3063                                1'h0
   31      R      RESERVED3062                                1'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t reserved_31: 1;
        const uint32_t reserved_30: 1;
        const uint32_t reserved_29: 1;
        const uint32_t reserved_28: 1;
        const uint32_t reserved_27: 1;
        const uint32_t reserved_26: 1;
        const uint32_t reserved_25: 1;
        const uint32_t reserved_24: 1;
        const uint32_t reserved_23: 1;
        const uint32_t reserved_22: 1;
        const uint32_t reserved_21: 1;
        const uint32_t reserved_20: 1;
        const uint32_t reserved_19: 1;
        const uint32_t reserved_18: 1;
        const uint32_t reserved_17: 1;
        const uint32_t reserved_16: 1;
        const uint32_t reserved_15: 1;
        const uint32_t reserved_14: 1;
        const uint32_t reserved_13: 1;
        const uint32_t reserved_12: 1;
        const uint32_t reserved_11: 1;
        const uint32_t reserved_10: 1;
        const uint32_t reserved_9: 1;
        const uint32_t reserved_8: 1;
        const uint32_t reserved_7: 1;
        const uint32_t reserved_6: 1;
        const uint32_t reserved_5: 1;
        const uint32_t reserved_4: 1;
        const uint32_t reserved_3: 1;
        const uint32_t reserved_2: 1;
        const uint32_t reserved_1: 1;
        const uint32_t reserved_0: 1;
    } b;
} TIMER_LAT_CNT_2_FIFO_FULL_INTR_EN_CTRL_TypeDef;


/* 0xA4C
   0       R      RESERVED3126                                1'h0
   1       R      RESERVED3125                                1'h0
   2       R      RESERVED3124                                1'h0
   3       R      RESERVED3123                                1'h0
   4       R      RESERVED3122                                1'h0
   5       R      RESERVED3121                                1'h0
   6       R      RESERVED3120                                1'h0
   7       R      RESERVED3119                                1'h0
   8       R      RESERVED3118                                1'h0
   9       R      RESERVED3117                                1'h0
   10      R      RESERVED3116                                1'h0
   11      R      RESERVED3115                                1'h0
   12      R      RESERVED3114                                1'h0
   13      R      RESERVED3113                                1'h0
   14      R      RESERVED3112                                1'h0
   15      R      RESERVED3111                                1'h0
   16      R      RESERVED3110                                1'h0
   17      R      RESERVED3109                                1'h0
   18      R      RESERVED3108                                1'h0
   19      R      RESERVED3107                                1'h0
   20      R      RESERVED3106                                1'h0
   21      R      RESERVED3105                                1'h0
   22      R      RESERVED3104                                1'h0
   23      R      RESERVED3103                                1'h0
   24      R      RESERVED3102                                1'h0
   25      R      RESERVED3101                                1'h0
   26      R      RESERVED3100                                1'h0
   27      R      RESERVED3099                                1'h0
   28      R      RESERVED3098                                1'h0
   29      R      RESERVED3097                                1'h0
   30      R      RESERVED3096                                1'h0
   31      R      RESERVED3095                                1'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t reserved_31: 1;
        const uint32_t reserved_30: 1;
        const uint32_t reserved_29: 1;
        const uint32_t reserved_28: 1;
        const uint32_t reserved_27: 1;
        const uint32_t reserved_26: 1;
        const uint32_t reserved_25: 1;
        const uint32_t reserved_24: 1;
        const uint32_t reserved_23: 1;
        const uint32_t reserved_22: 1;
        const uint32_t reserved_21: 1;
        const uint32_t reserved_20: 1;
        const uint32_t reserved_19: 1;
        const uint32_t reserved_18: 1;
        const uint32_t reserved_17: 1;
        const uint32_t reserved_16: 1;
        const uint32_t reserved_15: 1;
        const uint32_t reserved_14: 1;
        const uint32_t reserved_13: 1;
        const uint32_t reserved_12: 1;
        const uint32_t reserved_11: 1;
        const uint32_t reserved_10: 1;
        const uint32_t reserved_9: 1;
        const uint32_t reserved_8: 1;
        const uint32_t reserved_7: 1;
        const uint32_t reserved_6: 1;
        const uint32_t reserved_5: 1;
        const uint32_t reserved_4: 1;
        const uint32_t reserved_3: 1;
        const uint32_t reserved_2: 1;
        const uint32_t reserved_1: 1;
        const uint32_t reserved_0: 1;
    } b;
} TIMER_LAT_CNT_2_FIFO_MET_THRESHOLD_INTR_EN_CTRL_TypeDef;


/* 0xA50
   0       R      RESERVED3159                                1'h1
   1       R      RESERVED3158                                1'h1
   2       R      RESERVED3157                                1'h1
   3       R      RESERVED3156                                1'h1
   4       R      RESERVED3155                                1'h1
   5       R      RESERVED3154                                1'h1
   6       R      RESERVED3153                                1'h1
   7       R      RESERVED3152                                1'h1
   8       R      RESERVED3151                                1'h1
   9       R      RESERVED3150                                1'h1
   10      R      RESERVED3149                                1'h1
   11      R      RESERVED3148                                1'h1
   12      R      RESERVED3147                                1'h1
   13      R      RESERVED3146                                1'h1
   14      R      RESERVED3145                                1'h1
   15      R      RESERVED3144                                1'h1
   16      R      RESERVED3143                                1'h1
   17      R      RESERVED3142                                1'h1
   18      R      RESERVED3141                                1'h1
   19      R      RESERVED3140                                1'h1
   20      R      RESERVED3139                                1'h1
   21      R      RESERVED3138                                1'h1
   22      R      RESERVED3137                                1'h1
   23      R      RESERVED3136                                1'h1
   24      R      RESERVED3135                                1'h1
   25      R      RESERVED3134                                1'h1
   26      R      RESERVED3133                                1'h1
   27      R      RESERVED3132                                1'h1
   28      R      RESERVED3131                                1'h1
   29      R      RESERVED3130                                1'h1
   30      R      RESERVED3129                                1'h1
   31      R      RESERVED3128                                1'h1
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t reserved_31: 1;
        const uint32_t reserved_30: 1;
        const uint32_t reserved_29: 1;
        const uint32_t reserved_28: 1;
        const uint32_t reserved_27: 1;
        const uint32_t reserved_26: 1;
        const uint32_t reserved_25: 1;
        const uint32_t reserved_24: 1;
        const uint32_t reserved_23: 1;
        const uint32_t reserved_22: 1;
        const uint32_t reserved_21: 1;
        const uint32_t reserved_20: 1;
        const uint32_t reserved_19: 1;
        const uint32_t reserved_18: 1;
        const uint32_t reserved_17: 1;
        const uint32_t reserved_16: 1;
        const uint32_t reserved_15: 1;
        const uint32_t reserved_14: 1;
        const uint32_t reserved_13: 1;
        const uint32_t reserved_12: 1;
        const uint32_t reserved_11: 1;
        const uint32_t reserved_10: 1;
        const uint32_t reserved_9: 1;
        const uint32_t reserved_8: 1;
        const uint32_t reserved_7: 1;
        const uint32_t reserved_6: 1;
        const uint32_t reserved_5: 1;
        const uint32_t reserved_4: 1;
        const uint32_t reserved_3: 1;
        const uint32_t reserved_2: 1;
        const uint32_t reserved_1: 1;
        const uint32_t reserved_0: 1;
    } b;
} TIMER_LAT_CNT_2_FIFO_EMPTY_STS_TypeDef;


/* 0xA54
   0       R      RESERVED3192                                1'h0
   1       R      RESERVED3191                                1'h0
   2       R      RESERVED3190                                1'h0
   3       R      RESERVED3189                                1'h0
   4       R      RESERVED3188                                1'h0
   5       R      RESERVED3187                                1'h0
   6       R      RESERVED3186                                1'h0
   7       R      RESERVED3185                                1'h0
   8       R      RESERVED3184                                1'h0
   9       R      RESERVED3183                                1'h0
   10      R      RESERVED3182                                1'h0
   11      R      RESERVED3181                                1'h0
   12      R      RESERVED3180                                1'h0
   13      R      RESERVED3179                                1'h0
   14      R      RESERVED3178                                1'h0
   15      R      RESERVED3177                                1'h0
   16      R      RESERVED3176                                1'h0
   17      R      RESERVED3175                                1'h0
   18      R      RESERVED3174                                1'h0
   19      R      RESERVED3173                                1'h0
   20      R      RESERVED3172                                1'h0
   21      R      RESERVED3171                                1'h0
   22      R      RESERVED3170                                1'h0
   23      R      RESERVED3169                                1'h0
   24      R      RESERVED3168                                1'h0
   25      R      RESERVED3167                                1'h0
   26      R      RESERVED3166                                1'h0
   27      R      RESERVED3165                                1'h0
   28      R      RESERVED3164                                1'h0
   29      R      RESERVED3163                                1'h0
   30      R      RESERVED3162                                1'h0
   31      R      RESERVED3161                                1'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t reserved_31: 1;
        const uint32_t reserved_30: 1;
        const uint32_t reserved_29: 1;
        const uint32_t reserved_28: 1;
        const uint32_t reserved_27: 1;
        const uint32_t reserved_26: 1;
        const uint32_t reserved_25: 1;
        const uint32_t reserved_24: 1;
        const uint32_t reserved_23: 1;
        const uint32_t reserved_22: 1;
        const uint32_t reserved_21: 1;
        const uint32_t reserved_20: 1;
        const uint32_t reserved_19: 1;
        const uint32_t reserved_18: 1;
        const uint32_t reserved_17: 1;
        const uint32_t reserved_16: 1;
        const uint32_t reserved_15: 1;
        const uint32_t reserved_14: 1;
        const uint32_t reserved_13: 1;
        const uint32_t reserved_12: 1;
        const uint32_t reserved_11: 1;
        const uint32_t reserved_10: 1;
        const uint32_t reserved_9: 1;
        const uint32_t reserved_8: 1;
        const uint32_t reserved_7: 1;
        const uint32_t reserved_6: 1;
        const uint32_t reserved_5: 1;
        const uint32_t reserved_4: 1;
        const uint32_t reserved_3: 1;
        const uint32_t reserved_2: 1;
        const uint32_t reserved_1: 1;
        const uint32_t reserved_0: 1;
    } b;
} TIMER_LAT_CNT_2_FIFO_FULL_INTR_TypeDef;


/* 0xA58
   0       R      RESERVED3225                                1'h0
   1       R      RESERVED3224                                1'h0
   2       R      RESERVED3223                                1'h0
   3       R      RESERVED3222                                1'h0
   4       R      RESERVED3221                                1'h0
   5       R      RESERVED3220                                1'h0
   6       R      RESERVED3219                                1'h0
   7       R      RESERVED3218                                1'h0
   8       R      RESERVED3217                                1'h0
   9       R      RESERVED3216                                1'h0
   10      R      RESERVED3215                                1'h0
   11      R      RESERVED3214                                1'h0
   12      R      RESERVED3213                                1'h0
   13      R      RESERVED3212                                1'h0
   14      R      RESERVED3211                                1'h0
   15      R      RESERVED3210                                1'h0
   16      R      RESERVED3209                                1'h0
   17      R      RESERVED3208                                1'h0
   18      R      RESERVED3207                                1'h0
   19      R      RESERVED3206                                1'h0
   20      R      RESERVED3205                                1'h0
   21      R      RESERVED3204                                1'h0
   22      R      RESERVED3203                                1'h0
   23      R      RESERVED3202                                1'h0
   24      R      RESERVED3201                                1'h0
   25      R      RESERVED3200                                1'h0
   26      R      RESERVED3199                                1'h0
   27      R      RESERVED3198                                1'h0
   28      R      RESERVED3197                                1'h0
   29      R      RESERVED3196                                1'h0
   30      R      RESERVED3195                                1'h0
   31      R      RESERVED3194                                1'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t reserved_31: 1;
        const uint32_t reserved_30: 1;
        const uint32_t reserved_29: 1;
        const uint32_t reserved_28: 1;
        const uint32_t reserved_27: 1;
        const uint32_t reserved_26: 1;
        const uint32_t reserved_25: 1;
        const uint32_t reserved_24: 1;
        const uint32_t reserved_23: 1;
        const uint32_t reserved_22: 1;
        const uint32_t reserved_21: 1;
        const uint32_t reserved_20: 1;
        const uint32_t reserved_19: 1;
        const uint32_t reserved_18: 1;
        const uint32_t reserved_17: 1;
        const uint32_t reserved_16: 1;
        const uint32_t reserved_15: 1;
        const uint32_t reserved_14: 1;
        const uint32_t reserved_13: 1;
        const uint32_t reserved_12: 1;
        const uint32_t reserved_11: 1;
        const uint32_t reserved_10: 1;
        const uint32_t reserved_9: 1;
        const uint32_t reserved_8: 1;
        const uint32_t reserved_7: 1;
        const uint32_t reserved_6: 1;
        const uint32_t reserved_5: 1;
        const uint32_t reserved_4: 1;
        const uint32_t reserved_3: 1;
        const uint32_t reserved_2: 1;
        const uint32_t reserved_1: 1;
        const uint32_t reserved_0: 1;
    } b;
} TIMER_LAT_CNT_2_FIFO_MET_THRESHOLD_INTR_TypeDef;


/* 0xA5C
   0       R/WAC  reg_timer_0_pause                           1'h0
   1       R/WAC  reg_timer_1_pause                           1'h0
   2       R/WAC  reg_timer_2_pause                           1'h0
   3       R/WAC  reg_timer_3_pause                           1'h0
   4       R/WAC  reg_timer_4_pause                           1'h0
   5       R/WAC  reg_timer_5_pause                           1'h0
   6       R/WAC  reg_timer_6_pause                           1'h0
   7       R/WAC  reg_timer_7_pause                           1'h0
   8       R/WAC  reg_timer_8_pause                           1'h0
   9       R/WAC  reg_timer_9_pause                           1'h0
   10      R      RESERVED3248                                1'h0
   11      R      RESERVED3247                                1'h0
   12      R      RESERVED3246                                1'h0
   13      R      RESERVED3245                                1'h0
   14      R      RESERVED3244                                1'h0
   15      R      RESERVED3243                                1'h0
   16      R      RESERVED3242                                1'h0
   17      R      RESERVED3241                                1'h0
   18      R      RESERVED3240                                1'h0
   19      R      RESERVED3239                                1'h0
   20      R      RESERVED3238                                1'h0
   21      R      RESERVED3237                                1'h0
   22      R      RESERVED3236                                1'h0
   23      R      RESERVED3235                                1'h0
   24      R      RESERVED3234                                1'h0
   25      R      RESERVED3233                                1'h0
   26      R      RESERVED3232                                1'h0
   27      R      RESERVED3231                                1'h0
   28      R      RESERVED3230                                1'h0
   29      R      RESERVED3229                                1'h0
   30      R      RESERVED3228                                1'h0
   31      R      RESERVED3227                                1'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        uint32_t reg_timer_0_pause: 1;
        uint32_t reg_timer_1_pause: 1;
        uint32_t reg_timer_2_pause: 1;
        uint32_t reg_timer_3_pause: 1;
        uint32_t reg_timer_4_pause: 1;
        uint32_t reg_timer_5_pause: 1;
        uint32_t reg_timer_6_pause: 1;
        uint32_t reg_timer_7_pause: 1;
        uint32_t reg_timer_8_pause: 1;
        uint32_t reg_timer_9_pause: 1;
        const uint32_t reserved_21: 1;
        const uint32_t reserved_20: 1;
        const uint32_t reserved_19: 1;
        const uint32_t reserved_18: 1;
        const uint32_t reserved_17: 1;
        const uint32_t reserved_16: 1;
        const uint32_t reserved_15: 1;
        const uint32_t reserved_14: 1;
        const uint32_t reserved_13: 1;
        const uint32_t reserved_12: 1;
        const uint32_t reserved_11: 1;
        const uint32_t reserved_10: 1;
        const uint32_t reserved_9: 1;
        const uint32_t reserved_8: 1;
        const uint32_t reserved_7: 1;
        const uint32_t reserved_6: 1;
        const uint32_t reserved_5: 1;
        const uint32_t reserved_4: 1;
        const uint32_t reserved_3: 1;
        const uint32_t reserved_2: 1;
        const uint32_t reserved_1: 1;
        const uint32_t reserved_0: 1;
    } b;
} TIMER_PAUSE_CTRL_TypeDef;


