wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/io/rtl876x_tim_def.h
/* 0xA60
   0       R/W    reg_timer_0_pause_intr_en                   1'h0
   1       R/W    reg_timer_1_pause_intr_en                   1'h0
   2       R/W    reg_timer_2_pause_intr_en                   1'h0
   3       R/W    reg_timer_3_pause_intr_en                   1'h0
   4       R/W    reg_timer_4_pause_intr_en                   1'h0
   5       R/W    reg_timer_5_pause_intr_en                   1'h0
   6       R/W    reg_timer_6_pause_intr_en                   1'h0
   7       R/W    reg_timer_7_pause_intr_en                   1'h0
   8       R/W    reg_timer_8_pause_intr_en                   1'h0
   9       R/W    reg_timer_9_pause_intr_en                   1'h0
   10      R      RESERVED3281                                1'h0
   11      R      RESERVED3280                                1'h0
   12      R      RESERVED3279                                1'h0
   13      R      RESERVED3278                                1'h0
   14      R      RESERVED3277                                1'h0
   15      R      RESERVED3276                                1'h0
   16      R      RESERVED3275                                1'h0
   17      R      RESERVED3274                                1'h0
   18      R      RESERVED3273                                1'h0
   19      R      RESERVED3272                                1'h0
   20      R      RESERVED3271                                1'h0
   21      R      RESERVED3270                                1'h0
   22      R      RESERVED3269                                1'h0
   23      R      RESERVED3268                                1'h0
   24      R      RESERVED3267                                1'h0
   25      R      RESERVED3266                                1'h0
   26      R      RESERVED3265                                1'h0
   27      R      RESERVED3264                                1'h0
   28      R      RESERVED3263                                1'h0
   29      R      RESERVED3262                                1'h0
   30      R      RESERVED3261                                1'h0
   31      R      RESERVED3260                                1'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        uint32_t reg_timer_0_pause_intr_en: 1;
        uint32_t reg_timer_1_pause_intr_en: 1;
        uint32_t reg_timer_2_pause_intr_en: 1;
        uint32_t reg_timer_3_pause_intr_en: 1;
        uint32_t reg_timer_4_pause_intr_en: 1;
        uint32_t reg_timer_5_pause_intr_en: 1;
        uint32_t reg_timer_6_pause_intr_en: 1;
        uint32_t reg_timer_7_pause_intr_en: 1;
        uint32_t reg_timer_8_pause_intr_en: 1;
        uint32_t reg_timer_9_pause_intr_en: 1;
        const uint32_t reserved_21: 1;
        const uint32_t reserved_20: 1;
        const uint32_t reserved_19: 1;
        const uint32_t reserved_18: 1;
        const uint32_t reserved_17: 1;
        const uint32_t reserved_16: 1;
        const uint32_t reserved_15: 1;
        const uint32_t reserved_14: 1;
        const uint32_t reserved_13: 1;
        const uint32_t reserved_12: 1;
        const uint32_t reserved_11: 1;
        const uint32_t reserved_10: 1;
        const uint32_t reserved_9: 1;
        const uint32_t reserved_8: 1;
        const uint32_t reserved_7: 1;
        const uint32_t reserved_6: 1;
        const uint32_t reserved_5: 1;
        const uint32_t reserved_4: 1;
        const uint32_t reserved_3: 1;
        const uint32_t reserved_2: 1;
        const uint32_t reserved_1: 1;
        const uint32_t reserved_0: 1;
    } b;
} TIMER_PAUSE_INTR_EN_CTRL_TypeDef;


/* 0xA64
   0       R/W1C  reg_timer_0_pause_intr_sts                  1'h0
   1       R/W1C  reg_timer_1_pause_intr_sts                  1'h0
   2       R/W1C  reg_timer_2_pause_intr_sts                  1'h0
   3       R/W1C  reg_timer_3_pause_intr_sts                  1'h0
   4       R/W1C  reg_timer_4_pause_intr_sts                  1'h0
   5       R/W1C  reg_timer_5_pause_intr_sts                  1'h0
   6       R/W1C  reg_timer_6_pause_intr_sts                  1'h0
   7       R/W1C  reg_timer_7_pause_intr_sts                  1'h0
   8       R/W1C  reg_timer_8_pause_intr_sts                  1'h0
   9       R/W1C  reg_timer_9_pause_intr_sts                  1'h0
   10      R      RESERVED3314                                1'h0
   11      R      RESERVED3313                                1'h0
   12      R      RESERVED3312                                1'h0
   13      R      RESERVED3311                                1'h0
   14      R      RESERVED3310                                1'h0
   15      R      RESERVED3309                                1'h0
   16      R      RESERVED3308                                1'h0
   17      R      RESERVED3307                                1'h0
   18      R      RESERVED3306                                1'h0
   19      R      RESERVED3305                                1'h0
   20      R      RESERVED3304                                1'h0
   21      R      RESERVED3303                                1'h0
   22      R      RESERVED3302                                1'h0
   23      R      RESERVED3301                                1'h0
   24      R      RESERVED3300                                1'h0
   25      R      RESERVED3299                                1'h0
   26      R      RESERVED3298                                1'h0
   27      R      RESERVED3297                                1'h0
   28      R      RESERVED3296                                1'h0
   29      R      RESERVED3295                                1'h0
   30      R      RESERVED3294                                1'h0
   31      R      RESERVED3293                                1'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        uint32_t reg_timer_0_pause_intr_sts: 1;
        uint32_t reg_timer_1_pause_intr_sts: 1;
        uint32_t reg_timer_2_pause_intr_sts: 1;
        uint32_t reg_timer_3_pause_intr_sts: 1;
        uint32_t reg_timer_4_pause_intr_sts: 1;
        uint32_t reg_timer_5_pause_intr_sts: 1;
        uint32_t reg_timer_6_pause_intr_sts: 1;
        uint32_t reg_timer_7_pause_intr_sts: 1;
        uint32_t reg_timer_8_pause_intr_sts: 1;
        uint32_t reg_timer_9_pause_intr_sts: 1;
        const uint32_t reserved_21: 1;
        const uint32_t reserved_20: 1;
        const uint32_t reserved_19: 1;
        const uint32_t reserved_18: 1;
        const uint32_t reserved_17: 1;
        const uint32_t reserved_16: 1;
        const uint32_t reserved_15: 1;
        const uint32_t reserved_14: 1;
        const uint32_t reserved_13: 1;
        const uint32_t reserved_12: 1;
        const uint32_t reserved_11: 1;
        const uint32_t reserved_10: 1;
        const uint32_t reserved_9: 1;
        const uint32_t reserved_8: 1;
        const uint32_t reserved_7: 1;
        const uint32_t reserved_6: 1;
        const uint32_t reserved_5: 1;
        const uint32_t reserved_4: 1;
        const uint32_t reserved_3: 1;
        const uint32_t reserved_2: 1;
        const uint32_t reserved_1: 1;
        const uint32_t reserved_0: 1;
    } b;
} TIMER_PAUSE_INTR_STS_TypeDef;


/* 0xA68
   0       R      reg_timer_0_pause_intr_sts_masked           1'h0
   1       R      reg_timer_1_pause_intr_sts_masked           1'h0
   2       R      reg_timer_2_pause_intr_sts_masked           1'h0
   3       R      reg_timer_3_pause_intr_sts_masked           1'h0
   4       R      reg_timer_4_pause_intr_sts_masked           1'h0
   5       R      reg_timer_5_pause_intr_sts_masked           1'h0
   6       R      reg_timer_6_pause_intr_sts_masked           1'h0
   7       R      reg_timer_7_pause_intr_sts_masked           1'h0
   8       R      reg_timer_8_pause_intr_sts_masked           1'h0
   9       R      reg_timer_9_pause_intr_sts_masked           1'h0
   10      R      RESERVED3347                                1'h0
   11      R      RESERVED3346                                1'h0
   12      R      RESERVED3345                                1'h0
   13      R      RESERVED3344                                1'h0
   14      R      RESERVED3343                                1'h0
   15      R      RESERVED3342                                1'h0
   16      R      RESERVED3341                                1'h0
   17      R      RESERVED3340                                1'h0
   18      R      RESERVED3339                                1'h0
   19      R      RESERVED3338                                1'h0
   20      R      RESERVED3337                                1'h0
   21      R      RESERVED3336                                1'h0
   22      R      RESERVED3335                                1'h0
   23      R      RESERVED3334                                1'h0
   24      R      RESERVED3333                                1'h0
   25      R      RESERVED3332                                1'h0
   26      R      RESERVED3331                                1'h0
   27      R      RESERVED3330                                1'h0
   28      R      RESERVED3329                                1'h0
   29      R      RESERVED3328                                1'h0
   30      R      RESERVED3327                                1'h0
   31      R      RESERVED3326                                1'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t reg_timer_0_pause_intr_sts_masked: 1;
        const uint32_t reg_timer_1_pause_intr_sts_masked: 1;
        const uint32_t reg_timer_2_pause_intr_sts_masked: 1;
        const uint32_t reg_timer_3_pause_intr_sts_masked: 1;
        const uint32_t reg_timer_4_pause_intr_sts_masked: 1;
        const uint32_t reg_timer_5_pause_intr_sts_masked: 1;
        const uint32_t reg_timer_6_pause_intr_sts_masked: 1;
        const uint32_t reg_timer_7_pause_intr_sts_masked: 1;
        const uint32_t reg_timer_8_pause_intr_sts_masked: 1;
        const uint32_t reg_timer_9_pause_intr_sts_masked: 1;
        const uint32_t reserved_21: 1;
        const uint32_t reserved_20: 1;
        const uint32_t reserved_19: 1;
        const uint32_t reserved_18: 1;
        const uint32_t reserved_17: 1;
        const uint32_t reserved_16: 1;
        const uint32_t reserved_15: 1;
        const uint32_t reserved_14: 1;
        const uint32_t reserved_13: 1;
        const uint32_t reserved_12: 1;
        const uint32_t reserved_11: 1;
        const uint32_t reserved_10: 1;
        const uint32_t reserved_9: 1;
        const uint32_t reserved_8: 1;
        const uint32_t reserved_7: 1;
        const uint32_t reserved_6: 1;
        const uint32_t reserved_5: 1;
        const uint32_t reserved_4: 1;
        const uint32_t reserved_3: 1;
        const uint32_t reserved_2: 1;
        const uint32_t reserved_1: 1;
        const uint32_t reserved_0: 1;
    } b;
} TIMER_PAUSE_INTR_TypeDef;


/* 0xA6C
   31:0    R      RESERVED3359                                32'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t reserved_0: 32;
    } b;
} TIMER_DMY_TypeDef;


/* 0xA70
   0       R      RESERVED3392                                1'h0
   1       R      RESERVED3391                                1'h0
   2       R      RESERVED3390                                1'h0
   3       R      RESERVED3389                                1'h0
   4       R      RESERVED3388                                1'h0
   5       R      RESERVED3387                                1'h0
   6       R      RESERVED3386                                1'h0
   7       R      RESERVED3385                                1'h0
   8       R      RESERVED3384                                1'h0
   9       R      RESERVED3383                                1'h0
   10      R      RESERVED3382                                1'h0
   11      R      RESERVED3381                                1'h0
   12      R      RESERVED3380                                1'h0
   13      R      RESERVED3379                                1'h0
   14      R      RESERVED3378                                1'h0
   15      R      RESERVED3377                                1'h0
   16      R      RESERVED3376                                1'h0
   17      R      RESERVED3375                                1'h0
   18      R      RESERVED3374                                1'h0
   19      R      RESERVED3373                                1'h0
   20      R      RESERVED3372                                1'h0
   21      R      RESERVED3371                                1'h0
   22      R      RESERVED3370                                1'h0
   23      R      RESERVED3369                                1'h0
   24      R      RESERVED3368                                1'h0
   25      R      RESERVED3367                                1'h0
   26      R      RESERVED3366                                1'h0
   27      R      RESERVED3365                                1'h0
   28      R      RESERVED3364                                1'h0
   29      R      RESERVED3363                                1'h0
   30      R      RESERVED3362                                1'h0
   31      R      RESERVED3361                                1'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t reserved_31: 1;
        const uint32_t reserved_30: 1;
        const uint32_t reserved_29: 1;
        const uint32_t reserved_28: 1;
        const uint32_t reserved_27: 1;
        const uint32_t reserved_26: 1;
        const uint32_t reserved_25: 1;
        const uint32_t reserved_24: 1;
        const uint32_t reserved_23: 1;
        const uint32_t reserved_22: 1;
        const uint32_t reserved_21: 1;
        const uint32_t reserved_20: 1;
        const uint32_t reserved_19: 1;
        const uint32_t reserved_18: 1;
        const uint32_t reserved_17: 1;
        const uint32_t reserved_16: 1;
        const uint32_t reserved_15: 1;
        const uint32_t reserved_14: 1;
        const uint32_t reserved_13: 1;
        const uint32_t reserved_12: 1;
        const uint32_t reserved_11: 1;
        const uint32_t reserved_10: 1;
        const uint32_t reserved_9: 1;
        const uint32_t reserved_8: 1;
        const uint32_t reserved_7: 1;
        const uint32_t reserved_6: 1;
        const uint32_t reserved_5: 1;
        const uint32_t reserved_4: 1;
        const uint32_t reserved_3: 1;
        const uint32_t reserved_2: 1;
        const uint32_t reserved_1: 1;
        const uint32_t reserved_0: 1;
    } b;
} TIMER_Q_CH_FW_CTRL0_TypeDef;


