wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/io/rtl876x_tim_def.h
/* 0xA74
   0       R      RESERVED3425                                1'h0
   1       R      RESERVED3424                                1'h0
   2       R      RESERVED3423                                1'h0
   3       R      RESERVED3422                                1'h0
   4       R      RESERVED3421                                1'h0
   5       R      RESERVED3420                                1'h0
   6       R      RESERVED3419                                1'h0
   7       R      RESERVED3418                                1'h0
   8       R      RESERVED3417                                1'h0
   9       R      RESERVED3416                                1'h0
   10      R      RESERVED3415                                1'h0
   11      R      RESERVED3414                                1'h0
   12      R      RESERVED3413                                1'h0
   13      R      RESERVED3412                                1'h0
   14      R      RESERVED3411                                1'h0
   15      R      RESERVED3410                                1'h0
   16      R      RESERVED3409                                1'h0
   17      R      RESERVED3408                                1'h0
   18      R      RESERVED3407                                1'h0
   19      R      RESERVED3406                                1'h0
   20      R      RESERVED3405                                1'h0
   21      R      RESERVED3404                                1'h0
   22      R      RESERVED3403                                1'h0
   23      R      RESERVED3402                                1'h0
   24      R      RESERVED3401                                1'h0
   25      R      RESERVED3400                                1'h0
   26      R      RESERVED3399                                1'h0
   27      R      RESERVED3398                                1'h0
   28      R      RESERVED3397                                1'h0
   29      R      RESERVED3396                                1'h0
   30      R      RESERVED3395                                1'h0
   31      R      RESERVED3394                                1'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t reserved_31: 1;
        const uint32_t reserved_30: 1;
        const uint32_t reserved_29: 1;
        const uint32_t reserved_28: 1;
        const uint32_t reserved_27: 1;
        const uint32_t reserved_26: 1;
        const uint32_t reserved_25: 1;
        const uint32_t reserved_24: 1;
        const uint32_t reserved_23: 1;
        const uint32_t reserved_22: 1;
        const uint32_t reserved_21: 1;
        const uint32_t reserved_20: 1;
        const uint32_t reserved_19: 1;
        const uint32_t reserved_18: 1;
        const uint32_t reserved_17: 1;
        const uint32_t reserved_16: 1;
        const uint32_t reserved_15: 1;
        const uint32_t reserved_14: 1;
        const uint32_t reserved_13: 1;
        const uint32_t reserved_12: 1;
        const uint32_t reserved_11: 1;
        const uint32_t reserved_10: 1;
        const uint32_t reserved_9: 1;
        const uint32_t reserved_8: 1;
        const uint32_t reserved_7: 1;
        const uint32_t reserved_6: 1;
        const uint32_t reserved_5: 1;
        const uint32_t reserved_4: 1;
        const uint32_t reserved_3: 1;
        const uint32_t reserved_2: 1;
        const uint32_t reserved_1: 1;
        const uint32_t reserved_0: 1;
    } b;
} TIMER_Q_CH_FW_CTRL1_TypeDef;


/* 0xA78
   31:0    R      RESERVED3427                                32'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t reserved_0: 32;
    } b;
} TIMER_Q_CH_DMY_0_TypeDef;


/* 0xA7C
   31:0    R      RESERVED3429                                32'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t reserved_0: 32;
    } b;
} TIMER_Q_CH_DMY_1_TypeDef;


/* 0xA80
   0       R      RESERVED3462                                1'h0
   1       R      RESERVED3461                                1'h0
   2       R      RESERVED3460                                1'h0
   3       R      RESERVED3459                                1'h0
   4       R      RESERVED3458                                1'h0
   5       R      RESERVED3457                                1'h0
   6       R      RESERVED3456                                1'h0
   7       R      RESERVED3455                                1'h0
   8       R      RESERVED3454                                1'h0
   9       R      RESERVED3453                                1'h0
   10      R      RESERVED3452                                1'h0
   11      R      RESERVED3451                                1'h0
   12      R      RESERVED3450                                1'h0
   13      R      RESERVED3449                                1'h0
   14      R      RESERVED3448                                1'h0
   15      R      RESERVED3447                                1'h0
   16      R      RESERVED3446                                1'h0
   17      R      RESERVED3445                                1'h0
   18      R      RESERVED3444                                1'h0
   19      R      RESERVED3443                                1'h0
   20      R      RESERVED3442                                1'h0
   21      R      RESERVED3441                                1'h0
   22      R      RESERVED3440                                1'h0
   23      R      RESERVED3439                                1'h0
   24      R      RESERVED3438                                1'h0
   25      R      RESERVED3437                                1'h0
   26      R      RESERVED3436                                1'h0
   27      R      RESERVED3435                                1'h0
   28      R      RESERVED3434                                1'h0
   29      R      RESERVED3433                                1'h0
   30      R      RESERVED3432                                1'h0
   31      R      RESERVED3431                                1'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t reserved_31: 1;
        const uint32_t reserved_30: 1;
        const uint32_t reserved_29: 1;
        const uint32_t reserved_28: 1;
        const uint32_t reserved_27: 1;
        const uint32_t reserved_26: 1;
        const uint32_t reserved_25: 1;
        const uint32_t reserved_24: 1;
        const uint32_t reserved_23: 1;
        const uint32_t reserved_22: 1;
        const uint32_t reserved_21: 1;
        const uint32_t reserved_20: 1;
        const uint32_t reserved_19: 1;
        const uint32_t reserved_18: 1;
        const uint32_t reserved_17: 1;
        const uint32_t reserved_16: 1;
        const uint32_t reserved_15: 1;
        const uint32_t reserved_14: 1;
        const uint32_t reserved_13: 1;
        const uint32_t reserved_12: 1;
        const uint32_t reserved_11: 1;
        const uint32_t reserved_10: 1;
        const uint32_t reserved_9: 1;
        const uint32_t reserved_8: 1;
        const uint32_t reserved_7: 1;
        const uint32_t reserved_6: 1;
        const uint32_t reserved_5: 1;
        const uint32_t reserved_4: 1;
        const uint32_t reserved_3: 1;
        const uint32_t reserved_2: 1;
        const uint32_t reserved_1: 1;
        const uint32_t reserved_0: 1;
    } b;
} TIMER_RAP_CTRL0_TypeDef;


/* 0xA84
   0       R      RESERVED3495                                1'h0
   1       R      RESERVED3494                                1'h0
   2       R      RESERVED3493                                1'h0
   3       R      RESERVED3492                                1'h0
   4       R      RESERVED3491                                1'h0
   5       R      RESERVED3490                                1'h0
   6       R      RESERVED3489                                1'h0
   7       R      RESERVED3488                                1'h0
   8       R      RESERVED3487                                1'h0
   9       R      RESERVED3486                                1'h0
   10      R      RESERVED3485                                1'h0
   11      R      RESERVED3484                                1'h0
   12      R      RESERVED3483                                1'h0
   13      R      RESERVED3482                                1'h0
   14      R      RESERVED3481                                1'h0
   15      R      RESERVED3480                                1'h0
   16      R      RESERVED3479                                1'h0
   17      R      RESERVED3478                                1'h0
   18      R      RESERVED3477                                1'h0
   19      R      RESERVED3476                                1'h0
   20      R      RESERVED3475                                1'h0
   21      R      RESERVED3474                                1'h0
   22      R      RESERVED3473                                1'h0
   23      R      RESERVED3472                                1'h0
   24      R      RESERVED3471                                1'h0
   25      R      RESERVED3470                                1'h0
   26      R      RESERVED3469                                1'h0
   27      R      RESERVED3468                                1'h0
   28      R      RESERVED3467                                1'h0
   29      R      RESERVED3466                                1'h0
   30      R      RESERVED3465                                1'h0
   31      R      RESERVED3464                                1'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t reserved_31: 1;
        const uint32_t reserved_30: 1;
        const uint32_t reserved_29: 1;
        const uint32_t reserved_28: 1;
        const uint32_t reserved_27: 1;
        const uint32_t reserved_26: 1;
        const uint32_t reserved_25: 1;
        const uint32_t reserved_24: 1;
        const uint32_t reserved_23: 1;
        const uint32_t reserved_22: 1;
        const uint32_t reserved_21: 1;
        const uint32_t reserved_20: 1;
        const uint32_t reserved_19: 1;
        const uint32_t reserved_18: 1;
        const uint32_t reserved_17: 1;
        const uint32_t reserved_16: 1;
        const uint32_t reserved_15: 1;
        const uint32_t reserved_14: 1;
        const uint32_t reserved_13: 1;
        const uint32_t reserved_12: 1;
        const uint32_t reserved_11: 1;
        const uint32_t reserved_10: 1;
        const uint32_t reserved_9: 1;
        const uint32_t reserved_8: 1;
        const uint32_t reserved_7: 1;
        const uint32_t reserved_6: 1;
        const uint32_t reserved_5: 1;
        const uint32_t reserved_4: 1;
        const uint32_t reserved_3: 1;
        const uint32_t reserved_2: 1;
        const uint32_t reserved_1: 1;
        const uint32_t reserved_0: 1;
    } b;
} TIMER_RAP_CTRL1_TypeDef;


