wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/io/rtl876x_tim_def.h
/* 0xA88
   0       R      RESERVED3528                                1'h0
   1       R      RESERVED3527                                1'h0
   2       R      RESERVED3526                                1'h0
   3       R      RESERVED3525                                1'h0
   4       R      RESERVED3524                                1'h0
   5       R      RESERVED3523                                1'h0
   6       R      RESERVED3522                                1'h0
   7       R      RESERVED3521                                1'h0
   8       R      RESERVED3520                                1'h0
   9       R      RESERVED3519                                1'h0
   10      R      RESERVED3518                                1'h0
   11      R      RESERVED3517                                1'h0
   12      R      RESERVED3516                                1'h0
   13      R      RESERVED3515                                1'h0
   14      R      RESERVED3514                                1'h0
   15      R      RESERVED3513                                1'h0
   16      R      RESERVED3512                                1'h0
   17      R      RESERVED3511                                1'h0
   18      R      RESERVED3510                                1'h0
   19      R      RESERVED3509                                1'h0
   20      R      RESERVED3508                                1'h0
   21      R      RESERVED3507                                1'h0
   22      R      RESERVED3506                                1'h0
   23      R      RESERVED3505                                1'h0
   24      R      RESERVED3504                                1'h0
   25      R      RESERVED3503                                1'h0
   26      R      RESERVED3502                                1'h0
   27      R      RESERVED3501                                1'h0
   28      R      RESERVED3500                                1'h0
   29      R      RESERVED3499                                1'h0
   30      R      RESERVED3498                                1'h0
   31      R      RESERVED3497                                1'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t reserved_31: 1;
        const uint32_t reserved_30: 1;
        const uint32_t reserved_29: 1;
        const uint32_t reserved_28: 1;
        const uint32_t reserved_27: 1;
        const uint32_t reserved_26: 1;
        const uint32_t reserved_25: 1;
        const uint32_t reserved_24: 1;
        const uint32_t reserved_23: 1;
        const uint32_t reserved_22: 1;
        const uint32_t reserved_21: 1;
        const uint32_t reserved_20: 1;
        const uint32_t reserved_19: 1;
        const uint32_t reserved_18: 1;
        const uint32_t reserved_17: 1;
        const uint32_t reserved_16: 1;
        const uint32_t reserved_15: 1;
        const uint32_t reserved_14: 1;
        const uint32_t reserved_13: 1;
        const uint32_t reserved_12: 1;
        const uint32_t reserved_11: 1;
        const uint32_t reserved_10: 1;
        const uint32_t reserved_9: 1;
        const uint32_t reserved_8: 1;
        const uint32_t reserved_7: 1;
        const uint32_t reserved_6: 1;
        const uint32_t reserved_5: 1;
        const uint32_t reserved_4: 1;
        const uint32_t reserved_3: 1;
        const uint32_t reserved_2: 1;
        const uint32_t reserved_1: 1;
        const uint32_t reserved_0: 1;
    } b;
} TIMER_RAP_FW_TSAK_START_TypeDef;


/* 0xA8C
   0       R      RESERVED3561                                1'h0
   1       R      RESERVED3560                                1'h0
   2       R      RESERVED3559                                1'h0
   3       R      RESERVED3558                                1'h0
   4       R      RESERVED3557                                1'h0
   5       R      RESERVED3556                                1'h0
   6       R      RESERVED3555                                1'h0
   7       R      RESERVED3554                                1'h0
   8       R      RESERVED3553                                1'h0
   9       R      RESERVED3552                                1'h0
   10      R      RESERVED3551                                1'h0
   11      R      RESERVED3550                                1'h0
   12      R      RESERVED3549                                1'h0
   13      R      RESERVED3548                                1'h0
   14      R      RESERVED3547                                1'h0
   15      R      RESERVED3546                                1'h0
   16      R      RESERVED3545                                1'h0
   17      R      RESERVED3544                                1'h0
   18      R      RESERVED3543                                1'h0
   19      R      RESERVED3542                                1'h0
   20      R      RESERVED3541                                1'h0
   21      R      RESERVED3540                                1'h0
   22      R      RESERVED3539                                1'h0
   23      R      RESERVED3538                                1'h0
   24      R      RESERVED3537                                1'h0
   25      R      RESERVED3536                                1'h0
   26      R      RESERVED3535                                1'h0
   27      R      RESERVED3534                                1'h0
   28      R      RESERVED3533                                1'h0
   29      R      RESERVED3532                                1'h0
   30      R      RESERVED3531                                1'h0
   31      R      RESERVED3530                                1'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t reserved_31: 1;
        const uint32_t reserved_30: 1;
        const uint32_t reserved_29: 1;
        const uint32_t reserved_28: 1;
        const uint32_t reserved_27: 1;
        const uint32_t reserved_26: 1;
        const uint32_t reserved_25: 1;
        const uint32_t reserved_24: 1;
        const uint32_t reserved_23: 1;
        const uint32_t reserved_22: 1;
        const uint32_t reserved_21: 1;
        const uint32_t reserved_20: 1;
        const uint32_t reserved_19: 1;
        const uint32_t reserved_18: 1;
        const uint32_t reserved_17: 1;
        const uint32_t reserved_16: 1;
        const uint32_t reserved_15: 1;
        const uint32_t reserved_14: 1;
        const uint32_t reserved_13: 1;
        const uint32_t reserved_12: 1;
        const uint32_t reserved_11: 1;
        const uint32_t reserved_10: 1;
        const uint32_t reserved_9: 1;
        const uint32_t reserved_8: 1;
        const uint32_t reserved_7: 1;
        const uint32_t reserved_6: 1;
        const uint32_t reserved_5: 1;
        const uint32_t reserved_4: 1;
        const uint32_t reserved_3: 1;
        const uint32_t reserved_2: 1;
        const uint32_t reserved_1: 1;
        const uint32_t reserved_0: 1;
    } b;
} TIMER_RAP_FW_TASK_PAUSE_TypeDef;


/* 0xA90
   0       R      RESERVED3594                                1'h0
   1       R      RESERVED3593                                1'h0
   2       R      RESERVED3592                                1'h0
   3       R      RESERVED3591                                1'h0
   4       R      RESERVED3590                                1'h0
   5       R      RESERVED3589                                1'h0
   6       R      RESERVED3588                                1'h0
   7       R      RESERVED3587                                1'h0
   8       R      RESERVED3586                                1'h0
   9       R      RESERVED3585                                1'h0
   10      R      RESERVED3584                                1'h0
   11      R      RESERVED3583                                1'h0
   12      R      RESERVED3582                                1'h0
   13      R      RESERVED3581                                1'h0
   14      R      RESERVED3580                                1'h0
   15      R      RESERVED3579                                1'h0
   16      R      RESERVED3578                                1'h0
   17      R      RESERVED3577                                1'h0
   18      R      RESERVED3576                                1'h0
   19      R      RESERVED3575                                1'h0
   20      R      RESERVED3574                                1'h0
   21      R      RESERVED3573                                1'h0
   22      R      RESERVED3572                                1'h0
   23      R      RESERVED3571                                1'h0
   24      R      RESERVED3570                                1'h0
   25      R      RESERVED3569                                1'h0
   26      R      RESERVED3568                                1'h0
   27      R      RESERVED3567                                1'h0
   28      R      RESERVED3566                                1'h0
   29      R      RESERVED3565                                1'h0
   30      R      RESERVED3564                                1'h0
   31      R      RESERVED3563                                1'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t reserved_31: 1;
        const uint32_t reserved_30: 1;
        const uint32_t reserved_29: 1;
        const uint32_t reserved_28: 1;
        const uint32_t reserved_27: 1;
        const uint32_t reserved_26: 1;
        const uint32_t reserved_25: 1;
        const uint32_t reserved_24: 1;
        const uint32_t reserved_23: 1;
        const uint32_t reserved_22: 1;
        const uint32_t reserved_21: 1;
        const uint32_t reserved_20: 1;
        const uint32_t reserved_19: 1;
        const uint32_t reserved_18: 1;
        const uint32_t reserved_17: 1;
        const uint32_t reserved_16: 1;
        const uint32_t reserved_15: 1;
        const uint32_t reserved_14: 1;
        const uint32_t reserved_13: 1;
        const uint32_t reserved_12: 1;
        const uint32_t reserved_11: 1;
        const uint32_t reserved_10: 1;
        const uint32_t reserved_9: 1;
        const uint32_t reserved_8: 1;
        const uint32_t reserved_7: 1;
        const uint32_t reserved_6: 1;
        const uint32_t reserved_5: 1;
        const uint32_t reserved_4: 1;
        const uint32_t reserved_3: 1;
        const uint32_t reserved_2: 1;
        const uint32_t reserved_1: 1;
        const uint32_t reserved_0: 1;
    } b;
} TIMER_RAP_FW_TASK_DISABLE_TypeDef;


/* 0xA94
   0       R      RESERVED3627                                1'h0
   1       R      RESERVED3626                                1'h0
   2       R      RESERVED3625                                1'h0
   3       R      RESERVED3624                                1'h0
   4       R      RESERVED3623                                1'h0
   5       R      RESERVED3622                                1'h0
   6       R      RESERVED3621                                1'h0
   7       R      RESERVED3620                                1'h0
   8       R      RESERVED3619                                1'h0
   9       R      RESERVED3618                                1'h0
   10      R      RESERVED3617                                1'h0
   11      R      RESERVED3616                                1'h0
   12      R      RESERVED3615                                1'h0
   13      R      RESERVED3614                                1'h0
   14      R      RESERVED3613                                1'h0
   15      R      RESERVED3612                                1'h0
   16      R      RESERVED3611                                1'h0
   17      R      RESERVED3610                                1'h0
   18      R      RESERVED3609                                1'h0
   19      R      RESERVED3608                                1'h0
   20      R      RESERVED3607                                1'h0
   21      R      RESERVED3606                                1'h0
   22      R      RESERVED3605                                1'h0
   23      R      RESERVED3604                                1'h0
   24      R      RESERVED3603                                1'h0
   25      R      RESERVED3602                                1'h0
   26      R      RESERVED3601                                1'h0
   27      R      RESERVED3600                                1'h0
   28      R      RESERVED3599                                1'h0
   29      R      RESERVED3598                                1'h0
   30      R      RESERVED3597                                1'h0
   31      R      RESERVED3596                                1'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t reserved_31: 1;
        const uint32_t reserved_30: 1;
        const uint32_t reserved_29: 1;
        const uint32_t reserved_28: 1;
        const uint32_t reserved_27: 1;
        const uint32_t reserved_26: 1;
        const uint32_t reserved_25: 1;
        const uint32_t reserved_24: 1;
        const uint32_t reserved_23: 1;
        const uint32_t reserved_22: 1;
        const uint32_t reserved_21: 1;
        const uint32_t reserved_20: 1;
        const uint32_t reserved_19: 1;
        const uint32_t reserved_18: 1;
        const uint32_t reserved_17: 1;
        const uint32_t reserved_16: 1;
        const uint32_t reserved_15: 1;
        const uint32_t reserved_14: 1;
        const uint32_t reserved_13: 1;
        const uint32_t reserved_12: 1;
        const uint32_t reserved_11: 1;
        const uint32_t reserved_10: 1;
        const uint32_t reserved_9: 1;
        const uint32_t reserved_8: 1;
        const uint32_t reserved_7: 1;
        const uint32_t reserved_6: 1;
        const uint32_t reserved_5: 1;
        const uint32_t reserved_4: 1;
        const uint32_t reserved_3: 1;
        const uint32_t reserved_2: 1;
        const uint32_t reserved_1: 1;
        const uint32_t reserved_0: 1;
    } b;
} TIMER_RAP_STS_ACTIVE_TypeDef;


/* 0xA98
   0       R      RESERVED3660                                1'h0
   1       R      RESERVED3659                                1'h0
   2       R      RESERVED3658                                1'h0
   3       R      RESERVED3657                                1'h0
   4       R      RESERVED3656                                1'h0
   5       R      RESERVED3655                                1'h0
   6       R      RESERVED3654                                1'h0
   7       R      RESERVED3653                                1'h0
   8       R      RESERVED3652                                1'h0
   9       R      RESERVED3651                                1'h0
   10      R      RESERVED3650                                1'h0
   11      R      RESERVED3649                                1'h0
   12      R      RESERVED3648                                1'h0
   13      R      RESERVED3647                                1'h0
   14      R      RESERVED3646                                1'h0
   15      R      RESERVED3645                                1'h0
   16      R      RESERVED3644                                1'h0
   17      R      RESERVED3643                                1'h0
   18      R      RESERVED3642                                1'h0
   19      R      RESERVED3641                                1'h0
   20      R      RESERVED3640                                1'h0
   21      R      RESERVED3639                                1'h0
   22      R      RESERVED3638                                1'h0
   23      R      RESERVED3637                                1'h0
   24      R      RESERVED3636                                1'h0
   25      R      RESERVED3635                                1'h0
   26      R      RESERVED3634                                1'h0
   27      R      RESERVED3633                                1'h0
   28      R      RESERVED3632                                1'h0
   29      R      RESERVED3631                                1'h0
   30      R      RESERVED3630                                1'h0
   31      R      RESERVED3629                                1'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t reserved_31: 1;
        const uint32_t reserved_30: 1;
        const uint32_t reserved_29: 1;
        const uint32_t reserved_28: 1;
        const uint32_t reserved_27: 1;
        const uint32_t reserved_26: 1;
        const uint32_t reserved_25: 1;
        const uint32_t reserved_24: 1;
        const uint32_t reserved_23: 1;
        const uint32_t reserved_22: 1;
        const uint32_t reserved_21: 1;
        const uint32_t reserved_20: 1;
        const uint32_t reserved_19: 1;
        const uint32_t reserved_18: 1;
        const uint32_t reserved_17: 1;
        const uint32_t reserved_16: 1;
        const uint32_t reserved_15: 1;
        const uint32_t reserved_14: 1;
        const uint32_t reserved_13: 1;
        const uint32_t reserved_12: 1;
        const uint32_t reserved_11: 1;
        const uint32_t reserved_10: 1;
        const uint32_t reserved_9: 1;
        const uint32_t reserved_8: 1;
        const uint32_t reserved_7: 1;
        const uint32_t reserved_6: 1;
        const uint32_t reserved_5: 1;
        const uint32_t reserved_4: 1;
        const uint32_t reserved_3: 1;
        const uint32_t reserved_2: 1;
        const uint32_t reserved_1: 1;
        const uint32_t reserved_0: 1;
    } b;
} TIMER_RAP_SHORTCUT_SUB_TASK_PAUSE_TypeDef;


/* 0xA9C
   0       R      RESERVED3693                                1'h0
   1       R      RESERVED3692                                1'h0
   2       R      RESERVED3691                                1'h0
   3       R      RESERVED3690                                1'h0
   4       R      RESERVED3689                                1'h0
   5       R      RESERVED3688                                1'h0
   6       R      RESERVED3687                                1'h0
   7       R      RESERVED3686                                1'h0
   8       R      RESERVED3685                                1'h0
   9       R      RESERVED3684                                1'h0
   10      R      RESERVED3683                                1'h0
   11      R      RESERVED3682                                1'h0
   12      R      RESERVED3681                                1'h0
   13      R      RESERVED3680                                1'h0
   14      R      RESERVED3679                                1'h0
   15      R      RESERVED3678                                1'h0
   16      R      RESERVED3677                                1'h0
   17      R      RESERVED3676                                1'h0
   18      R      RESERVED3675                                1'h0
   19      R      RESERVED3674                                1'h0
   20      R      RESERVED3673                                1'h0
   21      R      RESERVED3672                                1'h0
   22      R      RESERVED3671                                1'h0
   23      R      RESERVED3670                                1'h0
   24      R      RESERVED3669                                1'h0
   25      R      RESERVED3668                                1'h0
   26      R      RESERVED3667                                1'h0
   27      R      RESERVED3666                                1'h0
   28      R      RESERVED3665                                1'h0
   29      R      RESERVED3664                                1'h0
   30      R      RESERVED3663                                1'h0
   31      R      RESERVED3662                                1'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t reserved_31: 1;
        const uint32_t reserved_30: 1;
        const uint32_t reserved_29: 1;
        const uint32_t reserved_28: 1;
        const uint32_t reserved_27: 1;
        const uint32_t reserved_26: 1;
        const uint32_t reserved_25: 1;
        const uint32_t reserved_24: 1;
        const uint32_t reserved_23: 1;
        const uint32_t reserved_22: 1;
        const uint32_t reserved_21: 1;
        const uint32_t reserved_20: 1;
        const uint32_t reserved_19: 1;
        const uint32_t reserved_18: 1;
        const uint32_t reserved_17: 1;
        const uint32_t reserved_16: 1;
        const uint32_t reserved_15: 1;
        const uint32_t reserved_14: 1;
        const uint32_t reserved_13: 1;
        const uint32_t reserved_12: 1;
        const uint32_t reserved_11: 1;
        const uint32_t reserved_10: 1;
        const uint32_t reserved_9: 1;
        const uint32_t reserved_8: 1;
        const uint32_t reserved_7: 1;
        const uint32_t reserved_6: 1;
        const uint32_t reserved_5: 1;
        const uint32_t reserved_4: 1;
        const uint32_t reserved_3: 1;
        const uint32_t reserved_2: 1;
        const uint32_t reserved_1: 1;
        const uint32_t reserved_0: 1;
    } b;
} TIMER_RAP_SHORTCUT_SUB_TASK_DISABLE_TypeDef;


