wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/io/rtl876x_tim_def.h
/* 0xAA0
   0       R      RESERVED3726                                1'h0
   1       R      RESERVED3725                                1'h0
   2       R      RESERVED3724                                1'h0
   3       R      RESERVED3723                                1'h0
   4       R      RESERVED3722                                1'h0
   5       R      RESERVED3721                                1'h0
   6       R      RESERVED3720                                1'h0
   7       R      RESERVED3719                                1'h0
   8       R      RESERVED3718                                1'h0
   9       R      RESERVED3717                                1'h0
   10      R      RESERVED3716                                1'h0
   11      R      RESERVED3715                                1'h0
   12      R      RESERVED3714                                1'h0
   13      R      RESERVED3713                                1'h0
   14      R      RESERVED3712                                1'h0
   15      R      RESERVED3711                                1'h0
   16      R      RESERVED3710                                1'h0
   17      R      RESERVED3709                                1'h0
   18      R      RESERVED3708                                1'h0
   19      R      RESERVED3707                                1'h0
   20      R      RESERVED3706                                1'h0
   21      R      RESERVED3705                                1'h0
   22      R      RESERVED3704                                1'h0
   23      R      RESERVED3703                                1'h0
   24      R      RESERVED3702                                1'h0
   25      R      RESERVED3701                                1'h0
   26      R      RESERVED3700                                1'h0
   27      R      RESERVED3699                                1'h0
   28      R      RESERVED3698                                1'h0
   29      R      RESERVED3697                                1'h0
   30      R      RESERVED3696                                1'h0
   31      R      RESERVED3695                                1'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t reserved_31: 1;
        const uint32_t reserved_30: 1;
        const uint32_t reserved_29: 1;
        const uint32_t reserved_28: 1;
        const uint32_t reserved_27: 1;
        const uint32_t reserved_26: 1;
        const uint32_t reserved_25: 1;
        const uint32_t reserved_24: 1;
        const uint32_t reserved_23: 1;
        const uint32_t reserved_22: 1;
        const uint32_t reserved_21: 1;
        const uint32_t reserved_20: 1;
        const uint32_t reserved_19: 1;
        const uint32_t reserved_18: 1;
        const uint32_t reserved_17: 1;
        const uint32_t reserved_16: 1;
        const uint32_t reserved_15: 1;
        const uint32_t reserved_14: 1;
        const uint32_t reserved_13: 1;
        const uint32_t reserved_12: 1;
        const uint32_t reserved_11: 1;
        const uint32_t reserved_10: 1;
        const uint32_t reserved_9: 1;
        const uint32_t reserved_8: 1;
        const uint32_t reserved_7: 1;
        const uint32_t reserved_6: 1;
        const uint32_t reserved_5: 1;
        const uint32_t reserved_4: 1;
        const uint32_t reserved_3: 1;
        const uint32_t reserved_2: 1;
        const uint32_t reserved_1: 1;
        const uint32_t reserved_0: 1;
    } b;
} TIMER_RAP_SHORTCUT_PUB_EVENT_TIMEOUT_TypeDef;


/* 0xAA4
   31:0    R      RESERVED3728                                32'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t reserved_0: 32;
    } b;
} TIMER_RAP_DMY_0_TypeDef;


/* 0xAA8
   31:0    R      RESERVED3730                                32'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t reserved_0: 32;
    } b;
} TIMER_RAP_DMY_1_TypeDef;


/* 0xAAC
   31:0    R      RESERVED3732                                32'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t reserved_0: 32;
    } b;
} TIMER_RAP_DMY_2_TypeDef;


/* 0xAB0
   31:0    R      reg_timer_ip_ver                            32'h2402206A
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t reg_timer_ip_ver: 32;
    } b;
} TIMER_IP_VER_TypeDef;

/*============================================================================*
 *                          TIM Constants
 *============================================================================*/
/** \defgroup TIM         TIM
  * \brief
  * \{
  */

/** \defgroup TIM_Exported_Constants TIM Exported Constants
  * \brief
  * \{
  */

/**
 * \defgroup    TIM_Clock_Source TIM Clock Source
 * \{
 * TIML_CH6, TIML_CH7, and TIML_CH8 supports CK_PLL1_TIMER and CK_PLL2_TIMER and CK_PLL3_TIMER and CK_40M_TIMER.
 * The other channels of timer only support CK_40M_TIMER.
 * \ingroup     TIM_Exported_Constants
 */

typedef enum
{
    CK_PLL2_TIMER = 0x0,
    CK_PLL3_TIMER = 0x1,
    CK_PLL1_TIMER = 0x2,
    CK_40M_TIMER  = 0x3,
} TIMClockSrc_TypeDef;

#define IS_TIM_CLK_SOURCE(PERIPH)     (((PERIPH) == CK_PLL2_TIMER) || \
                                       ((PERIPH) == CK_PLL3_TIMER) || \
                                       ((PERIPH) == CK_PLL1_TIMER) || \
                                       ((PERIPH) == CK_40M_TIMER))

/** End of TIM_Clock_Source
  * \}
  */

/**
 * \defgroup    TIM_Clock_Divider TIM Clock Divider
 * \{
 * \ingroup     TIM_Exported_Constants
 */

typedef enum
{
    TIM_CLOCK_DIVIDER_1 = 0x0,
    TIM_CLOCK_DIVIDER_2 = 0x1,
    TIM_CLOCK_DIVIDER_4 = 0x2,
    TIM_CLOCK_DIVIDER_8 = 0x3,
    TIM_CLOCK_DIVIDER_16 = 0x4,
    TIM_CLOCK_DIVIDER_32 = 0x5,
    TIM_CLOCK_DIVIDER_40 = 0x6,
    TIM_CLOCK_DIVIDER_64 = 0x7,
} TIMClockDiv_TypeDef;

#define IS_TIM_CLK_DIV(DIV) (((DIV) == TIM_CLOCK_DIVIDER_1) || \
                             ((DIV) == TIM_CLOCK_DIVIDER_2) || \
                             ((DIV) == TIM_CLOCK_DIVIDER_4) || \
                             ((DIV) == TIM_CLOCK_DIVIDER_8) || \
                             ((DIV) == TIM_CLOCK_DIVIDER_16) || \
                             ((DIV) == TIM_CLOCK_DIVIDER_32) || \
                             ((DIV) == TIM_CLOCK_DIVIDER_40) || \
                             ((DIV) == TIM_CLOCK_DIVIDER_64))

/** End of TIM_Clock_Divider
  * \}
  */

/** End of TIM_Exported_Constants
  * \}
  */

/** End of TIM
  * \}
  */

#ifdef  __cplusplus
}
#endif /* __cplusplus */

#endif /* RTL876X_TIM_DEF_H */

/******************* (C) COPYRIGHT 2024 Realtek Semiconductor Corporation *****END OF FILE****/
